/**
 * @file PreRender.c
 *
 * This file implements various routines important to framebuffer effects, such as RDP accelerated color and depth
 * buffer copies and coverage drawing. Also contains software implementations of the Video Interface anti-aliasing and
 * divot filters.
 */

#include "z64prerender.h"
#include "global.h"
#include "PR/gs2dex.h"
#include "libc/alloca.h"
#include "libc/stdbool.h"
#include "color.h"
#include "macros.h"
#include "slowly.h"
#include "stack.h"
#include "stackcheck.h"

/**
 * Assigns the "save" values in PreRender
 */
void PreRender_SetValuesSave(PreRender* this, u32 width, u32 height, void* fbuf, void* zbuf, void* cvg) {
    this->widthSave = width;
    this->heightSave = height;
    this->fbufSave = fbuf;
    this->cvgSave = cvg;
    this->zbufSave = zbuf;
    this->ulxSave = 0;
    this->ulySave = 0;
    this->lrxSave = width - 1;
    this->lrySave = height - 1;
}

void PreRender_Init(PreRender* this) {
    bzero(this, sizeof(PreRender));
    ListAlloc_Init(&this->alloc);
}

/**
 * Assigns the current values in PreRender
 */
void PreRender_SetValues(PreRender* this, u32 width, u32 height, void* fbuf, void* zbuf) {
    this->width = width;
    this->height = height;
    this->fbuf = fbuf;
    this->zbuf = zbuf;
    this->ulx = 0;
    this->uly = 0;
    this->lrx = width - 1;
    this->lry = height - 1;
}

void PreRender_Destroy(PreRender* this) {
    ListAlloc_FreeAll(&this->alloc);
}


            inPx.rgba = linePx[x];

            redRow2[x] = inPx.r;
            greenRow2[x] = inPx.g;
            blueRow2[x] = inPx.b;

            // checking for full coverage
            cvgFull[x] = (lineCvg[x] >> 5) == 7;
        }

        for (x = 1; x < width - 1; x++) {
            // if the coverage of the three adjacent pixels on the current line are not all fully covered
            if (cvgFull[x - 1] && cvgFull[x] && cvgFull[x + 1]) {
                continue;
            }

            // find median value in 3x3 square for each (r,g,b), replaces the pixel marked by X:
            //  * * *
            //  * * *
            //  * X *
            outPx.r = PreRender_Get5bMedian9(&redRow[0][x - 1], &redRow[1][x - 1], &redRow[2][x - 1]);
            outPx.g = PreRender_Get5bMedian9(&greenRow[0][x - 1], &greenRow[1][x - 1], &greenRow[2][x - 1]);
            outPx.b = PreRender_Get5bMedian9(&blueRow[0][x - 1], &blueRow[1][x - 1], &blueRow[2][x - 1]);
            outPx.a = 1;

            this->fbufSave[x + y * this->width] = outPx.rgba;
        }

        // Shuffle row 1 -> 0
        redRow[0] = redRow[1];
        greenRow[0] = greenRow[1];
        blueRow[0] = blueRow[1];
        // Shuffle row 2 -> 1
        redRow[1] = redRow[2];
        greenRow[1] = greenRow[2];
        blueRow[1] = blueRow[2];
    }
}

/**
 * Applies filters to the framebuffer prerender to make it look smoother
 */
void PreRender_ApplyFilters(PreRender* this) {
    if ((this->cvgSave == NULL) || (this->fbufSave == NULL)) {
        this->filterState = PRERENDER_FILTER_STATE_NONE;
    } else {
        this->filterState = PRERENDER_FILTER_STATE_PROCESS;
        PreRender_AntiAliasFilter(this);
        PreRender_DivotFilter(this);
        this->filterState = PRERENDER_FILTER_STATE_DONE;
    }
}

SlowlyMgr sSlowlyMgr;
s32 sSlowlyRunning;
StackEntry sSlowlyStackInfo;
STACK(sSlowlyStack, 0x1000);

/**
 * Initializes `PreRender_ApplyFilters` onto a new "slowly" thread
 */
void PreRender_ApplyFiltersSlowlyInit(PreRender* this) {
    if ((this->cvgSave != NULL) && (this->fbufSave != NULL)) {
        if (sSlowlyRunning) {
            StackCheck_Cleanup(&sSlowlyStackInfo);
            Slowly_Destroy(&sSlowlyMgr);
        }

        this->filterState = PRERENDER_FILTER_STATE_PROCESS;
        StackCheck_Init(&sSlowlyStackInfo, sSlowlyStack, STACK_TOP(sSlowlyStack), 0, 0x100, "slowly");
        Slowly_Init(&sSlowlyMgr, STACK_TOP(sSlowlyStack), (void*)PreRender_ApplyFilters, this, NULL);
        sSlowlyRunning = true;
    }
}

/**
 * Destroys the "slowly" thread
 */
void PreRender_ApplyFiltersSlowlyDestroy(PreRender* this) {
    if (sSlowlyRunning) {
        StackCheck_Cleanup(&sSlowlyStackInfo);
        Slowly_Destroy(&sSlowlyMgr);
        sSlowlyRunning = false;
    }
}

// Unused, likely since `PreRender_ApplyFilters` already handles NULL checks
void func_801720C4(PreRender* this) {
    if ((this->cvgSave != NULL) && (this->fbufSave != NULL)) {
        PreRender_ApplyFilters(this);
    }
}

typedef struct {
    /* 0x00 */ void* timg;
    /* 0x04 */ void* tlut;
    /* 0x08 */ u16 width;
    /* 0x0A */ u16 height;
    /* 0x0C */ u8 fmt;
    /* 0x0D */ u8 siz;
    /* 0x0E */ u16 tt;
    /* 0x10 */ u16 tlutCount;
    /* 0x14 */ f32 x;
    /* 0x18 */ f32 y;
    /* 0x1C */ f32 xScale;
    /* 0x20 */ f32 yScale;
    /* 0x24 */ u32 flags;
} PreRenderBackground2DParams; // size = 0x28

void Prerender_DrawBackground2DImpl(PreRenderBackground2DParams* bg2D, Gfx** gfxp) {
    Gfx* gfx;
    uObjBg* bg;
    u32 alphaCompare;
    Gfx* gfxTemp;
    u32 loadS2DEX2;

    loadS2DEX2 = (bg2D->flags & BG2D_FLAGS_LOAD_S2DEX2) != 0;
    alphaCompare = (bg2D->flags & BG2D_FLAGS_AC_THRESHOLD) ? G_AC_THRESHOLD : G_AC_NONE;

    gfxTemp = *gfxp;
    bg = Graph_DlistAlloc(&gfxTemp, sizeof(uObjBg));
    gfx = gfxTemp;

    bg->b.imageX = 0;
    bg->b.imageW = (bg2D->width * (1 << 2)) + 1;
    bg->b.frameX = bg2D->x * (1 << 2);

    bg->b.imageY = 0;
    bg->b.imageH = (bg2D->height * (1 << 2)) + 1;
    bg->b.frameY = bg2D->y * (1 << 2);

    bg->b.imagePtr = bg2D->timg;
    bg->b.imageLoad = G_BGLT_LOADTILE;
    bg->b.imageFmt = bg2D->fmt;
    bg->b.imageSiz = bg2D->siz;
    bg->b.imagePal = 0;
    bg->b.imageFlip = 0;

    if (loadS2DEX2) {
        gSPLoadUcodeL(gfx++, gspS2DEX2_fifo);
    }

