/*
 * File: z_actor.c
 * Description:
 */

//#include "prevent_bss_reordering.h"
#include "global.h"
#include "overlays/actors/ovl_En_Horse/z_en_horse.h"
#include "overlays/actors/ovl_En_Part/z_en_part.h"
#include "overlays/actors/ovl_En_Box/z_en_box.h"

// bss
extern FaultClient D_801ED8A0;    // 2 funcs
extern CollisionPoly* D_801ED8B0; // 1 func
extern s32 D_801ED8B4;            // 2 funcs
extern Actor* D_801ED8B8;         // 2 funcs
extern Actor* D_801ED8BC;         // 2 funcs
extern Actor* D_801ED8C0;         // 2 funcs
extern Actor* D_801ED8C4;         // 2 funcs
extern f32 D_801ED8C8;            // 2 funcs
extern f32 D_801ED8CC;            // 2 funcs
extern f32 D_801ED8D0;            // 2 funcs
extern s32 D_801ED8D4;            // 2 funcs
extern s32 D_801ED8D8;            // 2 funcs
extern s16 D_801ED8DC;            // 2 funcs
extern Mtx D_801ED8E0;            // 1 func
extern s32 D_801ED920;            // 2 funcs. 1 out of z_actor

void Actor_PrintLists(ActorContext* actorCtx) {
    ActorListEntry* actorList = &actorCtx->actorList[0];
    Actor* actor;
    s32 i;

    FaultDrawer_SetCharPad(-2, 0);
    FaultDrawer_Printf("actor\n", gMaxActorId);
    FaultDrawer_Printf("No. Actor   Name Part SegName\n");

    for (i = 0; i < ARRAY_COUNT(actorCtx->actorList); i++) {
        actor = actorList[i].first;

        while (actor != NULL) {
            FaultDrawer_Printf("%3d %08x %04x %3d %s\n", i, actor, actor->id, actor->category, "");
            actor = actor->next;

            if (func_800BC1B4(actor, explosive, arg2, explosive->speedXZ) != 0) {
                break;
            }
        }
        explosive = explosive->next;
    }

    return explosive;
}

s16 func_800BC4EC(Actor* actor, GlobalContext* globalCtx, f32 arg2, s16 arg3) {
    s16 temp_v1;
    u16 sp44;
    f32 sp40;
    f32 temp_f0;
    Vec3f sp30;

    Math_Vec3f_Copy(&sp30, &actor->world.pos);
    sp44 = actor->bgCheckFlags;
    sp40 = Math_SinS(arg3) * arg2;
    temp_f0 = Math_CosS(arg3);
    actor->world.pos.x += sp40;
    actor->world.pos.z += temp_f0 * arg2;
    Actor_UpdateBgCheckInfo(globalCtx, actor, 0.0f, 0.0f, 0.0f, 4);
    Math_Vec3f_Copy(&actor->world.pos, &sp30);
    temp_v1 = (actor->bgCheckFlags & 1);
    actor->bgCheckFlags = sp44;

    return temp_v1;
}

s32 func_800BC5B8(GameState* gameState, Actor* actor) {
    Player* player = GET_PLAYER(gameState);

    if ((player->stateFlags3 & 0x80000000) && (actor->isTargeted != 0)) {
        return 1;
    }
    return 0;
}

s32 func_800BC5EC(GlobalContext* globalCtx, Actor* actor) {
    Player* player = GET_PLAYER(globalCtx);

    if ((player->stateFlags3 & 0x80000000) && (actor->isTargeted == 0)) {
        return 1;
    }

    return 0;
}

void func_800BC620(Vec3f* arg0, Vec3f* arg1, u8 arg2, GlobalContext* globalCtx) {
    MtxF sp58;
    f32 sp54;
    Vec3f sp48;
    CollisionPoly* sp44;

    OPEN_DISPS(globalCtx->state.gfxCtx);

    POLY_OPA_DISP = Gfx_CallSetupDL(POLY_OPA_DISP, 0x2C);
    gDPSetPrimColor(POLY_OPA_DISP++, 0, 0, 0, 0, 0, arg2);

    sp48.x = arg0->x;
    sp48.y = arg0->y + 1.0f;
    sp48.z = arg0->z;

    sp54 = func_800C4000(globalCtx, &globalCtx->colCtx, &sp44, &sp48);
    if (sp44 != NULL) {
        func_800C0094(sp44, arg0->x, sp54, arg0->z, &sp58);
        SysMatrix_SetCurrentState(&sp58);
    } else {
        SysMatrix_InsertTranslation(arg0->x, arg0->y, arg0->z, 0);
    }
    Matrix_Scale(arg1->x, 1.0f, arg1->z, 1);

    gSPMatrix(POLY_OPA_DISP++, Matrix_NewMtx(globalCtx->state.gfxCtx), G_MTX_NOPUSH | G_MTX_LOAD | G_MTX_MODELVIEW);
    gSPDisplayList(POLY_OPA_DISP++, D_04076BC0);

    CLOSE_DISPS(globalCtx->state.gfxCtx);
}

void func_800BC770(GameState* gameState, s16 arg1, s16 arg2) {
    s16 sp26;
    GlobalContext* globalCtx = (GlobalContext*)gameState;

    sp26 = Quake_Add(&globalCtx->mainCamera, 3);
    Quake_SetSpeed(sp26, 20000);
    Quake_SetQuakeValues(sp26, arg1, 0, 0, 0);
    Quake_SetCountdown(sp26, arg2);
}

void func_800BC7D8(GameState* gameState, s16 arg1, s16 arg2, s16 arg3) {
    s16 sp26;
    GlobalContext* globalCtx = (GlobalContext*)gameState;

    sp26 = Quake_Add(&globalCtx->mainCamera, 3);
    Quake_SetSpeed(sp26, arg3);
    Quake_SetQuakeValues(sp26, arg1, 0, 0, 0);
    Quake_SetCountdown(sp26, arg2);
}

void func_800BC848(Actor* actor, GameState* gameState, s16 arg2, s16 arg3) {
    if (arg2 >= 5) {
        func_8013ECE0(actor->xyzDistToPlayerSq, 0xFF, 0x14, 0x96);
    } else {
        func_8013ECE0(actor->xyzDistToPlayerSq, 0xB4, 0x14, 0x64);
    }
    func_800BC770(gameState, arg2, arg3);
}

typedef struct {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ Gfx* unk_14;
    /* 0x18 */ Gfx* unk_18;
} struct_801AEDD4; // size = 0x1C

struct_801AEDD4 D_801AEDD4[] = {
    { 0.540000021458f, 6000.0f, 5000.0, 1.0f, 0.0f, 0x05000230, 0x05000140 },
    { 0.643999993801f, 12000.0f, 8000.0f, 1.0f, 0.0f, 0x06000530, 0x06000400 },
    { 0.6400000453f, 8500.0f, 8000.0f, 1.75f, 0.10000000149f, 0x05000230, 0x05000140 },
};

// Actor_DrawDoorLock
void func_800BC8B8(GlobalContext* globalCtx, s32 frame, s32 type) {
    s32 pad[2];
    MtxF spA8;
    s32 phi_s1;
    f32 temp_f22;
    f32 temp_f24;
    struct_801AEDD4* temp_s2;
    f32 phi_f20;
    f32 phi_f2;

    temp_s2 = &D_801AEDD4[type];
    phi_f20 = temp_s2->unk_10;

    OPEN_DISPS(globalCtx->state.gfxCtx);

    SysMatrix_InsertTranslation(0.0f, temp_s2->unk_08, 500.0f, MTXMODE_APPLY);
    SysMatrix_CopyCurrentState(&spA8);

    temp_f22 = __sinf(temp_s2->unk_00 - phi_f20) * -(10 - frame) * 0.1f * temp_s2->unk_04;
    temp_f24 = __cosf(temp_s2->unk_00 - phi_f20) * (10 - frame) * 0.1f * temp_s2->unk_04;

    for (phi_s1 = 0; phi_s1 < 4; phi_s1++) {
        SysMatrix_SetCurrentState(&spA8);
        SysMatrix_InsertZRotation_f(phi_f20, 1);
        SysMatrix_InsertTranslation(temp_f22, temp_f24, 0.0f, 1);
        if (temp_s2->unk_0C != 1.0f) {
            Matrix_Scale(temp_s2->unk_0C, temp_s2->unk_0C, temp_s2->unk_0C, 1);
        }

        gSPMatrix(POLY_OPA_DISP++, Matrix_NewMtx(globalCtx->state.gfxCtx), G_MTX_NOPUSH | G_MTX_LOAD | G_MTX_MODELVIEW);
        gSPDisplayList(POLY_OPA_DISP++, temp_s2->unk_14);

        if ((phi_s1 % 2) != 0) {
            phi_f2 = 2.0f * temp_s2->unk_00;
        } else {
            phi_f2 = M_PI - (2.0f * temp_s2->unk_00);
        }
        phi_f20 += phi_f2;
    }

    SysMatrix_SetCurrentState(&spA8);
    Matrix_Scale(frame * 0.1f, frame * 0.1f, frame * 0.1f, MTXMODE_APPLY);

    gSPMatrix(POLY_OPA_DISP++, Matrix_NewMtx(globalCtx->state.gfxCtx), G_MTX_NOPUSH | G_MTX_LOAD | G_MTX_MODELVIEW);
    gSPDisplayList(POLY_OPA_DISP++, temp_s2->unk_18);

    CLOSE_DISPS(globalCtx->state.gfxCtx);
}

void func_800BCB50(GlobalContext* arg0, Vec3f* arg1) {
    CollisionCheck_SpawnShieldParticlesMetal(arg0, arg1);
}

void func_800BCB70(Actor* actor, u16 arg1, u16 arg2, u16 arg3, u16 arg4) {
    if ((arg1 == 0x8000) && !(arg2 & 0x8000)) {
        Audio_PlayActorSound2(actor, 0x3836);
    }
    actor->colorFilterParams = arg1 | arg3 | ((arg2 & 0xF8) << 5) | arg4;
    actor->colorFilterTimer = arg4;
}

Hilite* func_800BCBF4(Vec3f* arg0, GlobalContext* globalCtx) {
    Vec3f lightDir;

    // lightDir.x = globalCtx->envCtx.dirLight1.params.dir.x;
    lightDir.x = globalCtx->envCtx.unk_28.params.dir.x;
    lightDir.y = globalCtx->envCtx.unk_28.params.dir.y;
    lightDir.z = globalCtx->envCtx.unk_28.params.dir.z;

    return func_800B7FE0(arg0, &globalCtx->view.eye, &lightDir, globalCtx->state.gfxCtx);
}

Hilite* func_800BCC68(Vec3f* arg0, GlobalContext* globalCtx) {
    Vec3f sp1C;

    sp1C.x = globalCtx->envCtx.unk_28.params.dir.x;
    sp1C.y = globalCtx->envCtx.unk_28.params.dir.y;
    sp1C.z = globalCtx->envCtx.unk_28.params.dir.z;
    return func_800B8018(arg0, &globalCtx->view.eye, &sp1C, globalCtx->state.gfxCtx);
}

#ifdef NON_MATCHING
// small regalloc
void func_800BCCDC(Vec3s* points, s32 pathcount, Vec3f* pos1, Vec3f* pos2, s32 parm5) {
    s32 spB4;
    s32 spB0;
    s32 spA8[2] = { 0, 0 };
    s32 spA0[2] = { 0, 0 };
    Vec3f sp94;
    Vec3f sp7C[2];
    Vec3f sp70;
    Vec3f sp64;
    f32 sp60;
    f32 sp5C;
    f32 sp54[2];

    spB0 = 0;
    sp5C = 1.6e9f;

    for (spB4 = 0; spB4 < pathcount; spB4++) {
        sp60 = Math3D_XZDistanceSquared(pos1->x, pos1->z, points[spB4].x, points[spB4].z);
        if (sp60 < sp5C) {
            sp5C = sp60;
            spB0 = spB4;
        }
    }

    sp94.x = points[spB0].x;
    sp94.z = points[spB0].z;
    pos2->y = points[spB0].y;
    if (spB0 != 0) {
        sp64.x = points[spB0 - 1].x;
        sp64.z = points[spB0 - 1].z;
    } else if (parm5) {
        sp64.x = points[pathcount - 1].x;
        sp64.z = points[pathcount - 1].z;
    }

    if ((spB0 != 0) || (parm5)) {
        spA8[0] =
            Math3D_PointDistToLine2D(pos1->x, pos1->z, sp64.x, sp64.z, sp94.x, sp94.z, &sp7C[0].x, &sp7C[0].z, &sp60);
    }

    if (spB0 + 1 != pathcount) {
        sp70.x = points[spB0 + 1].x;
        sp70.z = points[spB0 + 1].z;
    } else if (parm5) {
        sp70.x = points->x;
        sp70.z = points->z;
    }

    if ((spB0 + 1 != pathcount) || (parm5)) {
        spA8[1] =
            Math3D_PointDistToLine2D(pos1->x, pos1->z, sp94.x, sp94.z, sp70.x, sp70.z, &sp7C[1].x, &sp7C[1].z, &sp60);
    }

    if (parm5) {
        s32 phi_s0_2;

        spA0[0] = ((sp64.x - pos1->x) * (sp94.z - pos1->z)) < ((sp64.z - pos1->z) * (sp94.x - pos1->x));
        spA0[1] = ((sp70.z - pos1->z) * (sp94.x - pos1->x)) < ((sp94.z - pos1->z) * (sp70.x - pos1->x));

        for (phi_s0_2 = 0; phi_s0_2 < ARRAY_COUNT(sp54); phi_s0_2++) {
            if ((spA8)[phi_s0_2] != 0) {
                sp54[phi_s0_2] = Math3D_XZDistanceSquared(pos1->x, pos1->z, sp7C[phi_s0_2].x, sp7C[phi_s0_2].z);
            } else {
                sp54[phi_s0_2] = 1.6e9f;
            }
        }
    }

    if ((parm5) && (((spA0[0] != 0) && (spA0[1] != 0)) || ((spA0[0] != 0) && (spA8[0] != 0) && (sp54[0] < sp54[1])) ||
                    ((spA0[1] != 0) && (spA8[1] != 0) && (sp54[1] < sp54[0])))) {
        pos2->x = pos1->x;
        pos2->z = pos1->z;
    } else if ((spA8[0] != 0) && (spA8[1] != 0)) {
        if ((spA0[0] == 0) && (spA0[1] == 0)) {
            if (Math3D_PointDistToLine2D(pos1->x, pos1->z, sp7C[0].x, sp7C[0].z, sp7C[1].x, sp7C[1].z, &pos2->x,
                                         &pos2->z, &sp60) == 0) {
                pos2->x = (sp7C[1].x + sp7C[0].x) * 0.5f;
                pos2->z = (sp7C[1].z + sp7C[0].z) * 0.5f;
            }
        } else if (sp54[1] < sp54[0]) {
            pos2->x = sp7C[1].x;
            pos2->z = sp7C[1].z;
        } else {
            pos2->x = sp7C[0].x;
            pos2->z = sp7C[0].z;
        }
    } else if (spA8[0] != 0) {
        pos2->x = sp7C[0].x;
        pos2->z = sp7C[0].z;
    } else if (spA8[1] != 0) {
        pos2->x = sp7C[1].x;
        pos2->z = sp7C[1].z;
    } else if ((parm5) && ((((sp64.x - pos1->x) * (sp70.z - pos1->z)) < ((sp64.z - pos1->z) * (sp70.x - pos1->x))))) {
        pos2->x = pos1->x;
        pos2->z = pos1->z;
    } else {
        pos2->x = sp94.x;
        pos2->z = sp94.z;
    }
}
#else
s32 D_801AEE28[] = { 0, 0 };
s32 D_801AEE30[] = { 0, 0 };
#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BCCDC.s")
#endif

// unused
s32 func_800BD2B4(GameState* gameState, Actor* actor, s16* arg2, f32 arg3, u16 (*arg4)(GameState*, Actor*),
                  s16 (*arg5)(GameState*, Actor*)) {
    if (Actor_RequestTalk(actor, gameState)) {
        *arg2 = 1;
        return 1;
    } else if (*arg2 != 0) {
        *arg2 = arg5(gameState, actor);
        return 0;
    } else if (func_800B8934(gameState, actor) == 0) {
        return 0;
    } else if (!func_800B8614(actor, gameState, arg3)) {
        return 0;
    } else {
        actor->textId = arg4(gameState, actor);
        return 0;
    }
}

typedef struct {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ s16 unk_08;
    /* 0x0A */ s16 unk_0A;
    /* 0x0C */ u8 unk_0C;
} struct_801AEE38_0; // size = 0x10

typedef struct {
    /* 0x00 */ struct_801AEE38_0 sub_00;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ s16 unk_14;
} struct_801AEE38; // size = 0x18

struct_801AEE38 D_801AEE38[] = {
    { { 0x1C20, 0xE390, 0x1C70, 0x1554, 0, 0, 0 }, 170.0f, 0x3FFC },
    { { 0x2AA8, 0xEAAC, 0x1554, 0x1554, 0xF8E4, 0xE38, 1 }, 170.0f, 0x3FFC },
    { { 0x31C4, 0xE390, 0xE38, 0xE38, 0xF1C8, 0x71C, 1 }, 170.0f, 0x3FFC },
    { { 0x1554, 0xF1C8, 0, 0x71C, 0xF8E4, 0, 1 }, 170.0f, 0x3FFC },
    { { 0x2AA8, 0xF8E4, 0x71C, 0xE38, 0xD558, 0x2AA8, 1 }, 170.0f, 0x3FFC },
    { { 0, 0xE390, 0x2AA8, 0x3FFC, 0xF1C8, 0xE38, 1 }, 170.0f, 0x3FFC },
    { { 0x2AA8, 0xF1C8, 0xE38, 0xE38, 0, 0, 1 }, 0.0f, 0 },
    { { 0x2AA8, 0xF1C8, 0, 0xE38, 0, 0x1C70, 1 }, 0.0f, 0 },
    { { 0x2AA8, 0xF1C8, 0xF1C8, 0, 0, 0, 1 }, 0.0f, 0 },
    { { 0x71C, 0xF1C8, 0xE38, 0x1C70, 0, 0, 1 }, 0.0f, 0 },
    { { 0xE38, 0xF1C8, 0, 0x1C70, 0, 0xE38, 1 }, 0.0f, 0 },
    { { 0x2AA8, 0xE390, 0x1C70, 0xE38, 0xF1C8, 0xE38, 1 }, 0.0f, 0 },
    { { 0x18E2, 0xF1C8, 0xE38, 0xE38, 0, 0, 1 }, 0.0f, 0 },
