#include "global.h"

void Actor_PrintLists(ActorContext* actorCtx) {
    ActorListEntry* actorList = &actorCtx->actorList[0];
    Actor* actor;
    s32 i;

    FaultDrawer_SetCharPad(-2, 0);
    FaultDrawer_Printf("actor\n", gMaxActorId);
    FaultDrawer_Printf("No. Actor   Name Part SegName\n");

    for (i = 0; i < ARRAY_COUNT(actorCtx->actorList); i++) {
        actor = actorList[i].first;

        while (actor != NULL) {
            FaultDrawer_Printf("%3d %08x %04x %3d %s\n", i, actor, actor->id, actor->category, "");
            actor = actor->next;
        }
    }
}

void ActorShape_Init(ActorShape* actorShape, f32 yOffset, ActorShadowFunc shadowDraw, f32 shadowScale) {
    actorShape->yOffset = yOffset;
    actorShape->shadowDraw = shadowDraw;
    actorShape->shadowScale = shadowScale;
    actorShape->shadowAlpha = 255;
}

#ifdef NON_MATCHING
void ActorShadow_Draw(Actor* actor, Lights* lights, GlobalContext* globalCtx, Gfx* dlist, Color_RGBA8* color) {
    if (actor->floorPoly != NULL) {
        f32 dy = actor->world.pos.y - actor->floorHeight;

        if (dy >= -50.0f && dy < 500.0f) {
            f32 shadowScale;
            MtxF mtx;

            OPEN_DISPS(globalCtx->state.gfxCtx);

            POLY_OPA_DISP = Gfx_CallSetupDL(POLY_OPA_DISP, 0x2C);

            gDPSetCombineLERP(POLY_OPA_DISP++, 0, 0, 0, PRIMITIVE, TEXEL0, 0, PRIMITIVE, 0, 0, 0, 0, COMBINED, 0, 0, 0,
                              COMBINED);

            dy = CLAMP(dy, 0.0f, 150.0f);

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/Actor_LoadOverlay.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/Actor_SpawnAsChildAndCutscene.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/Actor_SpawnAsChild.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/Actor_SpawnTransitionActors.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BB2D0.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BB498.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BB59C.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BB604.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BB8EC.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BBA88.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BBAC0.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BBB74.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BBC20.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BBCEC.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BBDAC.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BBFB0.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC154.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC188.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC1B4.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC270.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC444.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC4EC.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC5B8.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC5EC.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC620.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC770.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC7D8.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC848.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BC8B8.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BCB50.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BCB70.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BCBF4.s")

#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BCC68.s")


#pragma GLOBAL_ASM("asm/non_matchings/code/z_actor/func_800BCCDC.s")

// unused
s32 func_800BD2B4(GlobalContext* globalCtx, Actor* actor, s16* arg2, f32 arg3, u16 (*arg4)(GlobalContext*, Actor*), s16 (*arg5)(GlobalContext*, Actor*)) {
    if (func_800B84D0(actor, globalCtx) != 0) {
        *arg2 = 1;
        return 1;
    } else if (*arg2 != 0) {
        *arg2 = arg5(globalCtx, actor);
        return 0;
    } else if (func_800B8934(globalCtx, actor) == 0) {
        return 0;
    } else if (func_800B8614(actor, globalCtx, arg3) == 0) {
        return 0;
    } else {
        actor->textId = arg4(globalCtx, actor);
        return 0;
    }
}


typedef struct {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ s16 unk_06;
    /* 0x08 */ s16 unk_08;
    /* 0x0A */ s16 unk_0A;
    /* 0x0C */ u8 unk_0C;
} struct_801AEE38_0; // size = 0x10

typedef struct {
    /* 0x00 */ struct_801AEE38_0 sub_00;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ s16 unk_14;
} struct_801AEE38; // size = 0x18

extern struct_801AEE38 D_801AEE38[];
#if 0
struct_801AEE38 D_801AEE38[14] = {
    {{0x1C20, 0xE390, 0x1C70, 0x1554, 0, 0, 0}, 170.0f, 0x3FFC},
    {{0x2AA8, 0xEAAC, 0x1554, 0x1554, 0xF8E4, 0xE38, 1}, 170.0f, 0x3FFC},
    {{0x31C4, 0xE390, 0xE38, 0xE38, 0xF1C8, 0x71C, 1}, 170.0f, 0x3FFC},
    {{0x1554, 0xF1C8, 0, 0x71C, 0xF8E4, 0, 1}, 170.0f, 0x3FFC},
    {{0x2AA8, 0xF8E4, 0x71C, 0xE38, 0xD558, 0x2AA8, 1}, 170.0f, 0x3FFC},
    {{0, 0xE390, 0x2AA8, 0x3FFC, 0xF1C8, 0xE38, 1}, 170.0f, 0x3FFC},
    {{0x2AA8, 0xF1C8, 0xE38, 0xE38, 0, 0, 1}, 0.0f, 0},
    {{0x2AA8, 0xF1C8, 0, 0xE38, 0, 0x1C70, 1}, 0.0f, 0},
    {{0x2AA8, 0xF1C8, 0xF1C8, 0, 0, 0, 1}, 0.0f, 0},
    {{0x71C, 0xF1C8, 0xE38, 0x1C70, 0, 0, 1}, 0.0f, 0},
    {{0xE38, 0xF1C8, 0, 0x1C70, 0, 0xE38, 1}, 0.0f, 0},
    {{0x2AA8, 0xE390, 0x1C70, 0xE38, 0xF1C8, 0xE38, 1}, 0.0f, 0},
    {{0x18E2, 0xF1C8, 0xE38, 0xE38, 0, 0, 1}, 0.0f, 0},
