#include "global.h"

#if 0

glabel D_801F4D40
/* 010DA0 801F4D40 */ .space 0x2

glabel D_801F4D42
/* 010DA2 801F4D42 */ .space 0x6

glabel D_801F4D48
/* 010DA8 801F4D48 */ .space 0x80

glabel D_801F4DC8
/* 010E28 801F4DC8 */ .space 0x2

glabel D_801F4DCA
/* 010E2A 801F4DCA */ .space 0x2

glabel D_801F4DCC
/* 010E2C 801F4DCC */ .space 0x10

glabel D_801F4DDC
/* 010E3C 801F4DDC */ .space 0x4

glabel D_801F4DE0
/* 010E40 801F4DE0 */ .space 0x2

glabel D_801F4DE2
/* 010E42 801F4DE2 */ .space 0xE
#endif


#if 0
void Cutscene_Init(GlobalContext* globalCtx, CutsceneContext* csCtx) {
    ?* temp_v0;
    ?* phi_v0;

    csCtx->state = 0;
    csCtx->frames = 0;
    csCtx->unk_0C = 0.0f;
    globalCtx->csCtx.sceneCsCount = 0;
    globalCtx->csCtx.unk_12 = 0;
    D_801F4DCA = 0;
    D_801F4DCA = 0;
    phi_v0 = &D_801F4DCC;
    do {
        temp_v0 = phi_v0 + 8;
        temp_v0->unk_-6 = 0;
        temp_v0->unk_-4 = 0;
        temp_v0->unk_-2 = 0;
        temp_v0->unk_-8 = 0;
        phi_v0 = temp_v0;
    } while (temp_v0 != &D_801F4DDC);
    D_801F4DE0 = 0;
    func_801A3F54(0);
}
#else
#pragma GLOBAL_ASM("asm/non_matchings/code/z_demo/Cutscene_Init.s")
#endif

void func_800EA0D4(GlobalContext* globalCtx, CutsceneContext* csCtx) {
    csCtx->state = 1;
    csCtx->linkAction = NULL;
}

void func_800EA0EC(GlobalContext* globalCtx, CutsceneContext* csCtx) {
    if (csCtx->state != 4) {
        csCtx->state = 3;
    }
}

void Cutscene_StepCutscene1(GlobalContext* globalCtx, CutsceneContext* csCtx) {
    if (gSaveContext.cutscene < 0xFFF0) {
        sCsStateHandlers1[csCtx->state](globalCtx, csCtx);
    }
}

void Cutscene_StepCutscene2(GlobalContext* globalCtx, CutsceneContext* csCtx) {
    if ((gSaveContext.cutsceneTrigger != 0) && (globalCtx->sceneLoadFlag == 0x14)) {
        gSaveContext.cutsceneTrigger = 0;
    }

    if ((gSaveContext.cutsceneTrigger != 0) && (csCtx->state == 0)) {
        gSaveContext.cutscene = 0xFFFD;
        gSaveContext.cutsceneTrigger = 1;
    }

    if (gSaveContext.cutscene >= 0xFFF0) {
        func_800EDA84(globalCtx, csCtx);
        sCsStateHandlers2[csCtx->state](globalCtx, csCtx);
    }
}

void Cutscene_Nop800EA210(GlobalContext* globalCtx, CutsceneContext* csCtx) {

}

s32 func_800EA220(GlobalContext* globalCtx, CutsceneContext* csCtx, f32 target) {
    return Math_StepToF(&csCtx->unk_0C, target, 0.1f);
}

void func_800EA258(GlobalContext* globalCtx, CutsceneContext* csCtx) {
    Interface_ChangeAlpha(1);
    ShrinkWindow_SetLetterboxTarget(0x20);
    if (func_800EA220(globalCtx, csCtx, 1.0f) != 0) {
        func_801A3F54(1);
        csCtx->state += 1;
    }
}

void func_800EA2B8(GlobalContext* globalCtx, CutsceneContext* csCtx) {
    func_800ED980(globalCtx, csCtx);
    Interface_ChangeAlpha(1);
    ShrinkWindow_SetLetterboxTarget(0x20);
    if (func_800EA220(globalCtx, csCtx, 1.0f) != 0) {
        func_801A3F54(1);
        csCtx->state += 1;
    }
}

#pragma GLOBAL_ASM("asm/non_matchings/code/z_demo/func_800EA324.s")
#if 0
struct _mips2c_stack_func_800EA324 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[4];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x13];                   /* maybe part of sp28[5]? */
    /* 0x3F */ u8 sp3F;                             /* inferred */
    /* 0x40 */ char pad_40[4];                      /* maybe part of sp3F[5]? */
    /* 0x44 */ Actor* sp44;                         /* inferred */
};                                                  /* size = 0x48 */

void Daytelop_Init(GameState* gameState);           /* extern */
? func_80144A94(SramContext*, u16, CsCmdBase*, GlobalContext*); /* extern */
? func_80146EE8(GlobalContext*, u16, CsCmdBase*, GlobalContext*); /* extern */
? func_80146F5C(GlobalContext*, u16, CsCmdBase*, GlobalContext*); /* extern */
? func_8019D758(CutsceneContext*, u16, CsCmdBase*, GlobalContext*); /* extern */
? func_801A47DC(?, ?, ?, GlobalContext*);           /* extern */
extern u8 D_801BB130;
extern u16 D_801BB15C;
extern s16 D_801F4D42;
extern s8 D_801F4DE0;
extern s8 D_801F4E68;

void func_800EA324(GlobalContext* globalCtx, CutsceneContext* csCtx, CsCmdBase* cmd) {
    Actor* sp44;
    u8 sp3F;
    s32 sp28;
    s32 sp20;
    Actor* temp_t2;
    GlobalContext* temp_a0_2;
    GlobalContext* temp_a3;
    GlobalContext* temp_a3_2;
    f32 temp_f0;
    f32 temp_f16;
