/*
 * File: z_en_horse.c
 * Overlay: ovl_En_Horse
 * Description: Epona
 */

#include "z_en_horse.h"
#include "z64horse.h"
#include "z64rumble.h"
#include "overlays/actors/ovl_En_In/z_en_in.h"
#include "overlays/actors/ovl_Obj_Um/z_obj_um.h"
#include "overlays/actors/ovl_En_Horse_Game_Check/z_en_horse_game_check.h"
#include "objects/object_horse_link_child/object_horse_link_child.h"

#define FLAGS (ACTOR_FLAG_10)

#define THIS ((EnHorse*)thisx)

void EnHorse_Init(Actor* thisx, PlayState* play2);
void EnHorse_Destroy(Actor* thisx, PlayState* play);
void EnHorse_Update(Actor* thisx, PlayState* play2);
void EnHorse_Draw(Actor* thisx, PlayState* play);

void func_8087D540(Actor* thisx, PlayState* play);
void EnHorse_StartMountedIdleResetAnim(EnHorse* this);
void EnHorse_StartMountedIdle(EnHorse* this);
void EnHorse_MountedIdle(EnHorse* this, PlayState* play);
void EnHorse_MountedIdleAnim(EnHorse* this);
void EnHorse_MountedIdleWhinny(EnHorse* this);
void EnHorse_StartTurning(EnHorse* this);
void EnHorse_StartWalkingFromIdle(EnHorse* this);
void EnHorse_StartWalkingInterruptable(EnHorse* this);
void EnHorse_StartWalking(EnHorse* this);
void EnHorse_StartTrotting(EnHorse* this);
void EnHorse_StartGallopingInterruptable(EnHorse* this);
void EnHorse_StartGalloping(EnHorse* this);
void EnHorse_StartBraking(EnHorse* this, PlayState* play);
void EnHorse_StartReversingInterruptable(EnHorse* this);
void EnHorse_StartReversing(EnHorse* this);

void EnHorse_SetFollowAnimation(EnHorse* this, PlayState* play);
void EnHorse_InitIngoHorse(EnHorse* this);
void EnHorse_UpdateIngoHorseAnim(EnHorse* this);
void func_80881290(EnHorse* this, PlayState* play);
void func_8088159C(EnHorse* this, PlayState* play);
void func_80881634(EnHorse* this);
void func_8088168C(EnHorse* this);
void EnHorse_CsMoveInit(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void EnHorse_CsMoveToPoint(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void EnHorse_CsPlayHighJumpAnim(EnHorse* this, PlayState* play);
void EnHorse_CsJumpInit(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void EnHorse_CsJump(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void EnHorse_CsRearingInit(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void EnHorse_CsRearing(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void EnHorse_WarpMoveInit(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void EnHorse_CsWarpMoveToPoint(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void EnHorse_CsWarpRearingInit(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void EnHorse_CsWarpRearing(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void EnHorse_InitCutscene(EnHorse* this, PlayState* play);
void EnHorse_InitHorsebackArchery(EnHorse* this);
void EnHorse_UpdateHbaAnim(EnHorse* this);
void func_80883BEC(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80883CB0(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80883D64(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80883DE0(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80883E10(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80883EA0(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80883F18(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80883F98(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80884010(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_808840C4(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80884194(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_8088424C(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80884314(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_808843B4(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80884444(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_808844E0(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80884564(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_80884604(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_808846B4(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_808846DC(EnHorse* this, PlayState* play, CsCmdActorCue* cue);
void func_808846F0(EnHorse* this, PlayState* play);
void func_80884994(EnHorse* this);
void func_80884D04(EnHorse* this, PlayState* play);
void EnHorse_StickDirection(Vec2f* curStick, f32* stickMag, s16* angle);
s32 EnHorse_GetMountSide(EnHorse* this, PlayState* play);

typedef struct {
    /* 0x0 */ s32 cueId;
    /* 0x4 */ s32 csFuncIdx;
} CsActionEntry; // size = 0x8

typedef struct {
    /* 0x0 */ s16 x;
    /* 0x2 */ s16 y;
    /* 0x4 */ s16 z;
    /* 0x6 */ s16 speed;
    /* 0x8 */ s16 angle;
} RaceWaypoint; // size = 0xA

typedef struct {
    /* 0x0 */ s32 numWaypoints;
    /* 0x4 */ RaceWaypoint* waypoints;
} RaceInfo; // size = 0x8

static AnimationHeader* sEponaAnimations[ENHORSE_ANIM_MAX] = {
    &gEponaIdleAnim,                      // ENHORSE_ANIM_IDLE
    &gEponaWhinnyAnim,                    // ENHORSE_ANIM_WHINNY
    &object_horse_link_child_Anim_005F64, // ENHORSE_ANIM_STOPPING
    &object_horse_link_child_Anim_004DE8, // ENHORSE_ANIM_REARING
    &gEponaWalkAnim,                      // ENHORSE_ANIM_WALK
    &gEponaTrotAnim,                      // ENHORSE_ANIM_TROT
    &gEponaGallopAnim,                    // ENHORSE_ANIM_GALLOP
    &object_horse_link_child_Anim_0035B0, // ENHORSE_ANIM_LOW_JUMP
    &object_horse_link_child_Anim_003D38, // ENHORSE_ANIM_HIGH_JUMP
};

static AnimationHeader* sHniAnimations[ENHORSE_ANIM_MAX] = {
    &gHorseIdleAnim,      // ENHORSE_ANIM_IDLE
    &gHorseShakeHeadAnim, // ENHORSE_ANIM_WHINNY
    &gHorseStopAnim,      // ENHORSE_ANIM_STOPPING
