typedef struct EnAn {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;
    /* 0x188 */ void (*actionFunc)(EnAn*, PlayState*);
    /* 0x18C */ s8 unk_18C[4];
    /* 0x190 */ ColliderCylinder unk_190;
    /* 0x1DC */ Path* unk_1DC;                      /* inferred */
    /* 0x1E0 */ char pad_1E0[0x10];                 /* maybe part of unk_1DC[5]? */
    /* 0x1F0 */ s32 unk_1F0;                        /* inferred */
    /* 0x1F4 */ s32 unk_1F4;                        /* inferred */
    /* 0x1F8 */ s32 unk_1F8;                        /* inferred */
    /* 0x1FC */ s32 unk_1FC;                        /* inferred */
    /* 0x200 */ u8 unk_200;
    /* 0x201 */ char pad_201[3];                    /* maybe part of unk_200[4]? */
    /* 0x204 */ void* unk_204;
    /* 0x208 */ s8 unk_208;
    /* 0x209 */ s8 unk_209;
    /* 0x20A */ s8 unk_20A;
    /* 0x20B */ s8 unk_20B;
    /* 0x20C */ s8 unk_20C;
    /* 0x20D */ char pad_20D[3];                    /* maybe part of unk_20C[4]? */
    /* 0x210 */ s32 unk_210;
    /* 0x214 */ s8 unk_214;
    /* 0x215 */ s8 unk_215;                         /* inferred */
    /* 0x216 */ char pad_216[2];                    /* maybe part of unk_215[3]? */
    /* 0x218 */ Actor* unk_218;
    /* 0x21C */ s8 unk_21C[0x24];
    /* 0x240 */ Vec3f unk_240;
    /* 0x24C */ s8 unk_24C[0xC];
    /* 0x258 */ Vec3s unk_258;
    /* 0x25E */ s8 unk_25E[2];
    /* 0x260 */ s8 unk_260[4];
    /* 0x264 */ Vec3s unk_264[0x15];
    /* 0x2E2 */ Vec3s unk_2E2[0x15];
    /* 0x360 */ u16 unk_360;
    /* 0x362 */ u16 unk_362;                        /* inferred */
    /* 0x364 */ s8 unk_364;
    /* 0x365 */ char pad_365[3];                    /* maybe part of unk_364[4]? */
    /* 0x368 */ f32 unk_368;
    /* 0x36C */ char pad_36C[8];                    /* maybe part of unk_368[3]? */
    /* 0x374 */ f32 unk_374;
    /* 0x378 */ s16 unk_378;                        /* inferred */
    /* 0x37A */ s16 unk_37A;                        /* inferred */
    /* 0x37C */ s16 unk_37C;
    /* 0x37E */ s16 unk_37E;
    /* 0x380 */ char pad_380[4];                    /* maybe part of unk_37E[3]? */
    /* 0x384 */ s16 unk_384;
    /* 0x386 */ char pad_386[2];
    /* 0x388 */ s16 unk_388;
    /* 0x38A */ s16 unk_38A;
    /* 0x38C */ s16 unk_38C;
    /* 0x38E */ s16 unk_38E;
    /* 0x390 */ s16 unk_390;
    /* 0x392 */ s16 unk_392;
    /* 0x394 */ s16 unk_394;                        /* inferred */
    /* 0x396 */ s16 unk_396;                        /* inferred */
    /* 0x398 */ void* unk_398;
    /* 0x39C */ s32 unk_39C;
    /* 0x3A0 */ char pad_3A0[8];                    /* maybe part of unk_39C[3]? */
    /* 0x3A8 */ u32 unk_3A8;
    /* 0x3AC */ u32 unk_3AC;
    /* 0x3B0 */ s32 unk_3B0;
    /* 0x3B4 */ s32 unk_3B4;
    /* 0x3B8 */ s32 unk_3B8;
    /* 0x3BC */ char pad_3BC[4];
    /* 0x3C0 */ s32 unk_3C0;
    /* 0x3C4 */ s32 unk_3C4;                        /* inferred */
} EnAn;                                             /* size = 0x3C8 */

Actor* func_80B539CC(EnAn* arg0, PlayState* arg1, u8 arg2, s16 arg3); /* static */
struct EnDoor* func_80B53B3C(PlayState* arg0, u8 arg1); /* static */
s32 func_80B54678(Actor* arg0, s16 arg1, s32);      /* static */
s16 func_80B546F4(Actor* arg0, s32 arg1);           /* static */
s16 func_80B54750(Actor* arg0, s32 arg1);           /* static */
s32 func_80B547C8(Actor* arg0, PlayState* arg1);    /* static */
s32 func_80B5492C(Actor* arg0, PlayState* arg1);    /* static */
s32 func_80B54A94(Actor* arg0, PlayState* arg1);    /* static */
s32 func_80B54BC4(Actor* arg0, PlayState* arg1);    /* static */
s32 func_80B54C5C(EnAn* arg0, PlayState* arg1);     /* static */
s32 func_80B54D18(EnAn* arg0, PlayState* arg1);     /* static */
?* func_80B54DF4(EnAn* arg0, PlayState* arg1);      /* static */
