/*
 * File: z_boss_01.c
 * Overlay: ovl_Boss_01
 * Description: Odolwa, his bugs, and his afterimages.
 *
 * In addition to handling Odolwa, this actor is also responsible for handling the bugs that Odolwa can spawn as well as
 * the afterimages that appear when Odolwa jumps or does a spin attack. The bugs are effectively their own actor with
 * their own Update and Draw functions and a whole dedicated section of the file specifically for them. Afterimages are
 * much simpler, and their code is more interleaved with Odolwa's code. This actor also handles the falling block and
 * ring of fire effects that Odolwa can summon.
 *
 * Odolwa's behavior can primarily be divided into two states: waiting and attacking. He has a variety of wait actions
 * and attack types that he can select between, and this can make it difficult to tell when he is waiting and when he is
 * attacking. Two of his wait actions look like attacks, and when selecting an attack, he can randomly choose to dance
 * for a bit before attacking. Additionally, Odolwa can attack the player via more indirect means while waiting by
 * summoning bugs, by dropping falling blocks on them, or by summoning a ring of fire to surround them.
 *
 * Outside of waiting and attacking, most of Odolwa's behavior involves either dodging attacks (e.g., by jumping,
 * running around, or guarding) or reacting to attacks. He also handles all his cutscenes (his intro cutscene, the

        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 15 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x00, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_NORMAL,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_ROOT, { { 0, 0, 0 }, 15 }, 100 },
    },
};

static ColliderJntSphInit sBodyColliderJntSphInit = {
    {
        COLTYPE_HIT3,
        AT_ON | AT_TYPE_ENEMY,
        AC_ON | AC_TYPE_PLAYER,
        OC1_ON | OC1_TYPE_PLAYER,
        OC2_TYPE_1,
        COLSHAPE_JNTSPH,
    },
    ARRAY_COUNT(sBodyColliderJntSphElementsInit),
    sBodyColliderJntSphElementsInit,
};

// The limbs referenced here are not used. The spheres are positioned manually by Boss01_PostLimbDraw.
static ColliderJntSphElementInit sKickAndShieldBashColliderJntSphElementsInit[2] = {
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x04, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_HARD,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_NONE, { { 0, 0, 0 }, 36 }, 100 },
    },
    {
        {
            ELEMTYPE_UNK3,
            { 0xF7CFFFFF, 0x04, 0x04 },
            { 0xF7CFFFFF, 0x00, 0x00 },
            TOUCH_ON | TOUCH_SFX_HARD,
            BUMP_ON,
            OCELEM_ON,
        },
        { ODOLWA_LIMB_NONE, { { 0, 0, 0 }, 36 }, 100 },
    },
};

static ColliderJntSphInit sKickAndShieldBashColliderJntSphInit = {
    {
        COLTYPE_HIT3,
        AT_ON | AT_TYPE_ENEMY,
        AC_ON | AC_TYPE_PLAYER,
        OC1_ON | OC1_TYPE_PLAYER,
        OC2_TYPE_1,
        COLSHAPE_JNTSPH,
    },
    ARRAY_COUNT(sKickAndShieldBashColliderJntSphElementsInit),
    sKickAndShieldBashColliderJntSphElementsInit,
};

static ColliderCylinderInit sBugACColliderCylinderInit = {
    {
        COLTYPE_HIT3,
        AT_ON | AT_TYPE_ENEMY,
        AC_ON | AC_TYPE_PLAYER,
        OC1_ON | OC1_TYPE_ALL,
        OC2_TYPE_1,
        COLSHAPE_CYLINDER,
    },
    {
        ELEMTYPE_UNK3,
        { 0xF7CFFFFF, 0x00, 0x04 },
        { 0xF7FFFFFF, 0x00, 0x00 },
        TOUCH_ON | TOUCH_SFX_NORMAL,
        BUMP_ON,
        OCELEM_ON,
    },
    { 15, 15, 10, { 0, 0, 0 } },
};

static ColliderCylinderInit sBugATColliderCylinderInit = {
    {
        COLTYPE_HIT3,
        AT_ON | AT_TYPE_ENEMY,
        AC_ON | AC_TYPE_PLAYER,
        OC1_ON | OC1_TYPE_ALL,
        OC2_TYPE_1,
        COLSHAPE_CYLINDER,
    },
    {
        ELEMTYPE_UNK3,
        { 0xF7CFFFFF, 0x00, 0x04 },
        { 0xF7FFFFFF, 0x00, 0x00 },
        TOUCH_ON | TOUCH_SFX_NORMAL,
        BUMP_ON,
        OCELEM_ON,
    },
    { 8, 15, 10, { 0, 0, 0 } },
};

ActorInit Boss_01_InitVars = {
    /**/ ACTOR_BOSS_01,
    /**/ ACTORCAT_BOSS,
    /**/ FLAGS,
    /**/ OBJECT_BOSS01,
    /**/ sizeof(Boss01),
    /**/ Boss01_Init,
    /**/ Boss01_Destroy,
    /**/ Boss01_Update,
    /**/ Boss01_Draw,
};

static Color_RGBA8 sDustPrimColor = { 60, 50, 20, 255 };

static Color_RGBA8 sDustEnvColor = { 40, 30, 30, 255 };

typedef struct {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ Vec3f velocity;
    /* 0x18 */ f32 gravity;
    /* 0x1C */ s16 rotX;
    /* 0x1E */ s16 rotY;
    /* 0x20 */ UNK_TYPE1 unk_20[0x8];
    /* 0x28 */ u8 type;
    /* 0x2A */ s16 timer;
    /* 0x2C */ s16 isFallingBlockFragment;
    /* 0x2E */ s16 angularVelocityX;
    /* 0x30 */ s16 angularVelocityY;
    /* 0x34 */ f32 scale;
    /* 0x38 */ f32 alpha;
} OdolwaEffect; // size = 0x3C

/**
 * Keeps track of how many bugs are currently spawned and alive. When there are four or fewer bugs alive, Odolwa can
 * summon more bugs or falling blocks.
 */
s16 sOdolwaBugCount;

/**
 * Pointer to the main Odolwa instance so that bugs and effects can check and manipulate his state.
 */
Boss01* sOdolwa;

/**
 * Pointer to the swarm of moths that Odolwa can summon.
 */
EnTanron1* sMothSwarm;

/**
 * Odolwa draws his sword trail manually by manipulating these variables during his horizontal and vertical slashes.
 * Note that the position of the sword is offset from Odolwa's position.
 */
f32 sOdolwaSwordTrailPosX;
f32 sOdolwaSwordTrailPosY;
f32 sOdolwaSwordTrailPosZ;
f32 sOdolwaSwordTrailRotX;
f32 sOdolwaSwordTrailRotY;
f32 sOdolwaSwordTrailRotZ;
f32 sOdolwaSwordTrailAlpha;

/**
 * If the intro cutscene was skipped (because it was already watched), this timer will be used to determine when to
