/*
 * File: z_en_knight.c
 * Overlay: ovl_En_Knight
 * Description: Igos du Ikana and his lackeys
 */

#include "prevent_bss_reordering.h"
#include "z_en_knight.h"
#include "z64shrink_window.h"
#include "attributes.h"
#include "overlays/actors/ovl_Mir_Ray3/z_mir_ray3.h"
#include "overlays/effects/ovl_Effect_Ss_Hitmark/z_eff_ss_hitmark.h"
#include "assets/objects/gameplay_keep/gameplay_keep.h"
#include "assets/objects/object_knight/object_knight.h"

#define FLAGS                                                                                 \
    (ACTOR_FLAG_ATTENTION_ENABLED | ACTOR_FLAG_HOSTILE | ACTOR_FLAG_UPDATE_CULLING_DISABLED | \
     ACTOR_FLAG_DRAW_CULLING_DISABLED)

void EnKnight_Init(Actor* thisx, PlayState* play);
void EnKnight_Destroy(Actor* thisx, PlayState* play);
void EnKnight_Update(Actor* thisx, PlayState* play);
void EnKnight_Draw(Actor* thisx, PlayState* play);

void EnKnight_UpdateAfterImage(Actor* thisx, PlayState* play);
void EnKnight_DrawAfterImage(Actor* thisx, PlayState* play);

void EnKnight_TelegraphHeavyAttack(EnKnight* this, PlayState* play);
void EnKnight_SetupHeavyAttack(EnKnight* this, PlayState* play);
void EnKnight_HeavyAttack(EnKnight* this, PlayState* play);
void EnKnight_SetupLowSwing(EnKnight* this, PlayState* play);
void EnKnight_LowSwing(EnKnight* this, PlayState* play);
void EnKnight_SetupLowSwingEnd(EnKnight* this, PlayState* play);
void EnKnight_LowSwingEnd(EnKnight* this, PlayState* play);
void EnKnight_SetupBasicSwing(EnKnight* this, PlayState* play);
void EnKnight_BasicSwing(EnKnight* this, PlayState* play);
void EnKnight_JumpAttack(EnKnight* this, PlayState* play);
void EnKnight_Blocking(EnKnight* this, PlayState* play);
void EnKnight_SetupWait(EnKnight* this, PlayState* play);
void EnKnight_Wait(EnKnight* this, PlayState* play);
void EnKnight_Strafe(EnKnight* this, PlayState* play);
void EnKnight_SetupTurnToPlayer(EnKnight* this, PlayState* play);
void EnKnight_TurnToPlayer(EnKnight* this, PlayState* play);
void EnKnight_SetupApproachPlayer(EnKnight* this, PlayState* play);
void EnKnight_ApproachPlayer(EnKnight* this, PlayState* play);
void EnKnight_Retreat(EnKnight* this, PlayState* play);
void EnKnight_GetBackUp(EnKnight* this, PlayState* play);
void EnKnight_Stunned(EnKnight* this, PlayState* play);
void EnKnight_RecoilFromDamage(EnKnight* this, PlayState* play);
void EnKnight_FallOver(EnKnight* this, PlayState* play);
void EnKnight_Die(EnKnight* this, PlayState* play);
void EnKnight_Dead(EnKnight* this, PlayState* play);
void EnKnight_SetupJumpBackwardsIgos(EnKnight* this, PlayState* play);
void EnKnight_JumpBackwards(EnKnight* this, PlayState* play);
void EnKnight_IgosReactToCurtains(EnKnight* this, PlayState* play);
void EnKnight_LookAtOther(EnKnight* this, PlayState* play);
void EnKnight_March(EnKnight* this, PlayState* play);
void EnKnight_SetupIntroCutscene(EnKnight* this, PlayState* play);
void EnKnight_SetupIgosSitting(EnKnight* this, PlayState* play);
void EnKnight_IgosSitting(EnKnight* this, PlayState* play);
void EnKnight_SetupDetachHead(EnKnight* this, PlayState* play);
void EnKnight_DetachHead(EnKnight* this, PlayState* play);
void EnKnight_FlyingHeadDone(EnKnight* this, PlayState* play);
void EnKnight_SetupBreathAttack(EnKnight* this, PlayState* play);
void EnKnight_BreathAttack(EnKnight* this, PlayState* play);
void EnKnight_SetupIgosStandCS(EnKnight* this, PlayState* play);
void EnKnight_IgosStandCS(EnKnight* this, PlayState* play);
void EnKnight_KnightCaptainsHatCS(EnKnight* this, PlayState* play);
void EnKnight_CaptainsHatCS(EnKnight* this, PlayState* play);
void EnKnight_WaitIntroCutscene(EnKnight* this, PlayState* play);
void EnKnight_IntroCutscene(EnKnight* this, PlayState* play);
void EnKnight_SetupFlyingHead(EnKnight* this, PlayState* play);
void EnKnight_FlyingHead(EnKnight* this, PlayState* play);
void EnKnight_SetupFlyingHeadAttack(EnKnight* this, PlayState* play);
void EnKnight_FlyingHeadAttack(EnKnight* this, PlayState* play);

void EnKnight_UpdateEffects(EnKnight* this, PlayState* play);
void EnKnight_DrawEffects(EnKnight* this, PlayState* play);

void EnKnight_SetupTelegraphHeavyAttack(EnKnight* this, PlayState* play, s32 noTelegraph);
void EnKnight_SetupStrafe(EnKnight* this, PlayState* play, s16 strafeAngle);
void EnKnight_SetupRetreat(EnKnight* this, PlayState* play, u8 shielding);

typedef struct {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ Vec3f velocity;
    /* 0x18 */ Vec3f accel;
    /* 0x24 */ UNK_TYPE1 unk_24[0x6];
    /* 0x2A */ u8 active;
    /* 0x2C */ s16 scrollTimer;
    /* 0x2E */ s16 alpha;
    /* 0x30 */ s16 unk_30; // set to 0 but unused
    /* 0x34 */ f32 scale;
    /* 0x38 */ f32 scaleTarget;
} EnKnightEffect; // size = 0x3C

static Vec3f sZeroVec = { 0.0f, 0.0f, 0.0f };

u8 sSpawnIndex = 0;

u8 sKnightMusicStartTimer = 0;

typedef enum {
    // None
    KNIGHT_DMGEFF_STATE_0 = 0,

    // Fire
    KNIGHT_DMGEFF_STATE_1,
    KNIGHT_DMGEFF_STATE_2,

    // Ice
    KNIGHT_DMGEFF_STATE_10 = 10,
    KNIGHT_DMGEFF_STATE_11,

    // Light
    KNIGHT_DMGEFF_STATE_20 = 20,
    KNIGHT_DMGEFF_STATE_21,

    // Light again?
    KNIGHT_DMGEFF_STATE_30 = 30,
    KNIGHT_DMGEFF_STATE_31,

    // Zora Barrier?
    KNIGHT_DMGEFF_STATE_40 = 40,
    KNIGHT_DMGEFF_STATE_41
} KnightDamageEffectState;

typedef enum {
    /*  0 */ KNIGHT_DMGEFF_NONE,
    /*  1 */ KNIGHT_DMGEFF_STUN,
    /*  2 */ KNIGHT_DMGEFF_FIRE,
    /*  3 */ KNIGHT_DMGEFF_ICE,
    /*  4 */ KNIGHT_DMGEFF_LIGHT,
    /* 10 */ KNIGHT_DMGEFF_ZORA_BARRIER = 10,
    /* 13 */ KNIGHT_DMGEFF_GORON_POUND = 13,
    /* 14 */ KNIGHT_DMGEFF_LIGHT_RAY,
    /* 15 */ KNIGHT_DMGEFF_OTHER
} EnKnightDamageEffect;

