#include "z_boss_07.h"
#include "overlays/actors/ovl_Obj_Tsubo/z_obj_tsubo.h"
#include "overlays/actors/ovl_En_Bom/z_en_bom.h"

#define FLAGS 0x00000035

#define THIS ((Boss07*)thisx)

#define FACING_ANGLE(actor1, actor2) ((s16)((actor1)->shape.rot.y - (actor2)->shape.rot.y + 0x8000))

typedef struct {
    /* 0x00 */ u8 unk_0;
    /* 0x02 */ s16 unk_2;
    /* 0x04 */ Vec3f unk_4;
    /* 0x10 */ Vec3f unk_10;
    /* 0x1C */ Vec3f unk_1C;
    /* 0x28 */ char unk28[4];
    /* 0x2C */ s16 unk_2C;
    /* 0x2E */ char unk2E[2];
    /* 0x30 */ s16 unk_30;
    /* 0x32 */ char unk32[2];
    /* 0x34 */ f32 unk_34;
    /* 0x38 */ char unk38[0x10];
} Boss07Effect;

void Boss07_Init(Actor* thisx, GlobalContext* globalCtx);
void Boss07_Destroy(Actor* thisx, GlobalContext* globalCtx);

void Boss07_Wrath_Update(Actor* thisx, GlobalContext* globalCtx);
void Boss07_Effects_Update(Actor* thisx, GlobalContext* globalCtx);
void Boss07_Remains_Update(Actor* thisx, GlobalContext* globalCtx);
void Boss07_Top_Update(Actor* thisx, GlobalContext* globalCtx);
void Boss07_Projectile_Update(Actor* thisx, GlobalContext* globalCtx);
void Boss07_Mask_Update(Actor* thisx, GlobalContext* globalCtx);
void Boss07_Incarnation_Update(Actor* thisx, GlobalContext* globalCtx);
void Boss07_Afterimage_Update(Actor* thisx, GlobalContext* globalCtx);

void Boss07_Wrath_Draw(Actor* thisx, GlobalContext* globalCtx);
void Boss07_Effects_Draw(Actor* thisx, GlobalContext* globalCtx);
void Boss07_Remains_Draw(Actor* thisx, GlobalContext* globalCtx);
void Boss07_Top_Draw(Actor* thisx, GlobalContext* globalCtx);
