/*
 * File: z_boss_07.c
 * Overlay: ovl_Boss_07
 * Description: Majora
 */

#include "z_boss_07.h"
#include "overlays/actors/ovl_Obj_Tsubo/z_obj_tsubo.h"
#include "overlays/actors/ovl_En_Bom/z_en_bom.h"
#include "objects/gameplay_keep/gameplay_keep.h"

#define FLAGS (ACTOR_FLAG_1 | ACTOR_FLAG_4 | ACTOR_FLAG_10 | ACTOR_FLAG_20)

#define THIS ((Boss07*)thisx)

#define FACING_ANGLE(actor1, actor2) ((s16)((actor1)->shape.rot.y - (actor2)->shape.rot.y + 0x8000))

#define EFFECT_COUNT 50

typedef enum {
    /* 0 */ REMAINS_ODOLWA,
    /* 1 */ REMAINS_GYORG,
    /* 2 */ REMAINS_GOHT,
    /* 3 */ REMAINS_TWINMOLD,
    /* 4 */ REMAINS_COUNT
} RemainsIndex;

typedef struct {
    /* 0x00 */ u8 type;
    /* 0x02 */ s16 scroll;
    /* 0x04 */ Vec3f pos;
    /* 0x10 */ Vec3f vel;
    /* 0x1C */ Vec3f accel;
    /* 0x28 */ UNK_TYPE1 unk28[4];
    /* 0x2C */ s16 alpha;
    /* 0x2E */ UNK_TYPE1 unk2E[2];
    /* 0x30 */ s16 isFading;
    /* 0x32 */ UNK_TYPE1 unk32[2];
    /* 0x34 */ f32 scale;
    /* 0x38 */ UNK_TYPE1 unk38[0x10];
} Boss07Effect; // size = 0x48

typedef enum {
    /* 0 */ MAJORA_EFFECT_NONE,
    /* 1 */ MAJORA_EFFECT_FLAME
} Boss07EffectType;

typedef enum {
   MAJORAS_WRATH_ATTACK_0,
   MAJORAS_WRATH_ATTACK_1,
   MAJORAS_WRATH_ATTACK_2,
   MAJORAS_WRATH_ATTACK_3,
   MAJORAS_WRATH_ATTACK_4,
   MAJORAS_WRATH_ATTACK_5,
   MAJORAS_WRATH_ATTACK_6,
   MAJORAS_WRATH_ATTACK_7,
   MAJORAS_WRATH_ATTACK_MAX,
} Boss07WrathActionStates;

typedef enum {
    MAJORAS_INCARNATION_STATE_0,
    MAJORAS_INCARNATION_STATE_1,
    MAJORAS_INCARNATION_STATE_2,
    MAJORAS_INCARNATION_STATE_MAX,
} Boss07IncarnationActionStates;

typedef enum {
    MAJORAS_MASK_SPIN_STATE_0,
    MAJORAS_MASK_SPIN_STATE_1,
    MAJORAS_MASK_SPIN_STATE_2,
    MAJORAS_MASK_SPIN_STATE_MAX,
} Boss07MaskSpinStates;

typedef enum {
    MAJORAS_MASK_BEAM_STATE_0,
    MAJORAS_MASK_BEAM_STATE_1,
    MAJORAS_MASK_BEAM_STATE_2,
    MAJORAS_MASK_BEAM_STATE_3,
    MAJORAS_MASK_BEAM_STATE_4,
