/*
 * File: z_boss_07.c
 * Overlay: ovl_Boss_07
 * Description: Majora
 */

#include "z_boss_07.h"
#include "z64shrink_window.h"
#include "overlays/actors/ovl_Obj_Tsubo/z_obj_tsubo.h"
#include "overlays/actors/ovl_En_Bom/z_en_bom.h"
#include "objects/gameplay_keep/gameplay_keep.h"
#include "objects/object_boss07/object_boss07.h"

#define FLAGS (ACTOR_FLAG_1 | ACTOR_FLAG_4 | ACTOR_FLAG_10 | ACTOR_FLAG_20)

#define THIS ((Boss07*)thisx)

#define FACING_ANGLE(actor1, actor2) ((s16)((actor1)->shape.rot.y - (actor2)->shape.rot.y + 0x8000))

#define EFFECT_COUNT 50

#define RIGHT_HAND 0
#define LEFT_HAND 1

typedef struct {
    /* 0x00 */ u8 type;
    /* 0x02 */ s16 scroll;
    /* 0x04 */ Vec3f pos;
    /* 0x10 */ Vec3f vel;
    /* 0x1C */ Vec3f accel;
    /* 0x28 */ UNK_TYPE1 unk28[4];
    /* 0x2C */ s16 alpha;
    /* 0x2E */ UNK_TYPE1 unk2E[2];
    /* 0x30 */ s16 isFading;
    /* 0x32 */ UNK_TYPE1 unk32[2];
    /* 0x34 */ f32 scale;
    /* 0x38 */ UNK_TYPE1 unk38[0x10];
} Boss07Effect; // size = 0x48

typedef enum {
    /* 0x0 */ MAJORAS_WRATH_DMGEFF_0,
    /* 0x2 */ MAJORAS_WRATH_DMGEFF_2 = 2,
    /* 0x3 */ MAJORAS_WRATH_DMGEFF_3,
    /* 0x4 */ MAJORAS_WRATH_DMGEFF_4,
    /* 0x9 */ MAJORAS_WRATH_DMGEFF_9 = 9,
    /* 0xA */ MAJORAS_WRATH_DMGEFF_A,
    /* 0xC */ MAJORAS_WRATH_DMGEFF_C = 0xC,
    /* 0xD */ MAJORAS_WRATH_DMGEFF_D,
    /* 0xE */ MAJORAS_WRATH_DMGEFF_E,
    /* 0xF */ MAJORAS_WRATH_DMGEFF_F,
} Boss07WrathDamageEffect;

typedef enum {
    /* 0x0 */ MAJORAS_INCARNATION_DMGEFF_0,
    /* 0x2 */ MAJORAS_INCARNATION_DMGEFF_2 = 2,
    /* 0x3 */ MAJORAS_INCARNATION_DMGEFF_3,
    /* 0x4 */ MAJORAS_INCARNATION_DMGEFF_4,
    /* 0x9 */ MAJORAS_INCARNATION_DMGEFF_9 = 9,
    /* 0xA */ MAJORAS_INCARNATION_DMGEFF_A,
    /* 0xC */ MAJORAS_INCARNATION_DMGEFF_C = 0xC,
    /* 0xD */ MAJORAS_INCARNATION_DMGEFF_D,
    /* 0xE */ MAJORAS_INCARNATION_DMGEFF_E,
    /* 0xF */ MAJORAS_INCARNATION_DMGEFF_F,
