/*
 * File: z_player.c
 * Overlay: ovl_player_actor
 * Description: Player
 */

#include "global.h"
#include "z64rumble.h"

#include "overlays/actors/ovl_Arms_Hook/z_arms_hook.h"
#include "overlays/actors/ovl_Door_Spiral/z_door_spiral.h"
#include "overlays/actors/ovl_Door_Shutter/z_door_shutter.h"
#include "overlays/actors/ovl_En_Arrow/z_en_arrow.h"
#include "overlays/actors/ovl_En_Bom/z_en_bom.h"
#include "overlays/actors/ovl_En_Boom/z_en_boom.h"
#include "overlays/actors/ovl_En_Box/z_en_box.h"
#include "overlays/actors/ovl_En_Door/z_en_door.h"
#include "overlays/actors/ovl_En_Horse/z_en_horse.h"
#include "overlays/actors/ovl_En_Ishi/z_en_ishi.h"
#include "overlays/actors/ovl_En_Test3/z_en_test3.h"
#include "overlays/actors/ovl_En_Test7/z_en_test7.h"
#include "overlays/actors/ovl_En_Torch2/z_en_torch2.h"

#include "objects/gameplay_keep/gameplay_keep.h"

#include "objects/object_link_boy/object_link_boy.h"
#include "objects/object_link_goron/object_link_goron.h"
#include "objects/object_link_zora/object_link_zora.h"
#include "objects/object_link_nuts/object_link_nuts.h"
#include "objects/object_link_child/object_link_child.h"

#define THIS ((Player*)thisx)

void Player_Init(Actor* thisx, PlayState* play);
void Player_Destroy(Actor* thisx, PlayState* play);
void Player_Update(Actor* thisx, PlayState* play);
void Player_Draw(Actor* thisx, PlayState* play);

s32 Player_GrabPlayer(PlayState* play, Player* player);
s32 func_8085B28C(PlayState* play, Player* player, s32 mode);
void func_8085B384(Player* player, PlayState* play);
s32 Player_InflictDamage(PlayState* play, s32 damage);
void func_8085B460(PlayState* play, Actor* actor);
void func_8085B74C(PlayState* play);
void func_8085B820(PlayState* play, s16 arg1);
PlayerActionParam func_8085B854(PlayState* play, Player* player, ItemID itemId);
s32 func_8085B930(PlayState* play, LinkAnimationHeader* talkAnim, s32 animMode);

void Player_UpdateCommon(Player* player, PlayState* play, Input* input);
s32 Player_StartFishing(PlayState* play);
void func_8085B170(PlayState* play, Player* this);
s32 func_8083A658(PlayState* play, Player* this);
void func_8082F8BC(PlayState* play, Player* this, PlayerActionParam actionParam);

void func_80831990(PlayState* play, Player* this, ItemID item);

s32 func_80848BF4(Player* this, PlayState* play);

void func_80836988(Player* this, PlayState* play);

void func_808484F0(Player* this);

void func_80838A20(PlayState* play, Player* this);
void func_80839978(PlayState* play, Player* this);
void func_80839A10(PlayState* play, Player* this);

typedef enum AnimSfxType {
    /*  1 */ ANIMSFX_TYPE_1 = 1,
    /*  2 */ ANIMSFX_TYPE_2,
    /*  3 */ ANIMSFX_TYPE_3,
    /*  4 */ ANIMSFX_TYPE_VOICE,
    /*  5 */ ANIMSFX_TYPE_5, // does not use sfxId
    /*  6 */ ANIMSFX_TYPE_6, // does not use sfxId
    /*  7 */ ANIMSFX_TYPE_7, // does not use sfxId
    /*  8 */ ANIMSFX_TYPE_8, // does not use sfxId
    /*  9 */ ANIMSFX_TYPE_9, // does not use sfxId
    /* 10 */ ANIMSFX_TYPE_10,
} AnimSfxType;

#define ANIMSFX_SHIFT_TYPE(type) ((type) << 11)

#define ANIMSFX_CONTINUE (1)
#define ANIMSFX_STOP (0)

#define ANIMSFX_FLAGS(type, frame, cont) \
    (((ANIMSFX_##cont) == ANIMSFX_STOP ? -1 : 1) * (ANIMSFX_SHIFT_TYPE(type) | ((frame)&0x7FF)))

#define ANIMSFX(type, frame, sfxId, cont) \
    { (sfxId), ANIMSFX_FLAGS(type, frame, cont) }

#define ANIMSFX_GET_TYPE(data) ((data)&0x7800)
#define ANIMSFX_GET_FRAME(data) ((data)&0x7FF)

typedef struct AnimSfxEntry {
    /* 0x0 */ u16 sfxId;
    /* 0x2 */ s16 flags; // negative marks the end
} AnimSfxEntry;          // size = 0x4

/* action funcs */
void func_808496AC(Player* this, PlayState* play);
void func_808497A0(Player* this, PlayState* play);
void func_80849A9C(Player* this, PlayState* play);
void func_80849DD0(Player* this, PlayState* play);
void func_80849FE0(Player* this, PlayState* play);
void func_8084A26C(Player* this, PlayState* play);
void func_8084A5C0(Player* this, PlayState* play);
void func_8084A794(Player* this, PlayState* play);
void func_8084A884(Player* this, PlayState* play);
void func_8084A8E8(Player* this, PlayState* play);
void func_8084AB4C(Player* this, PlayState* play);
void func_8084AC84(Player* this, PlayState* play);
void func_8084AEEC(Player* this, PlayState* play);
void func_8084AF9C(Player* this, PlayState* play);
void func_8084B0EC(Player* this, PlayState* play);
void func_8084B288(Player* this, PlayState* play);
void func_8084B3B8(Player* this, PlayState* play);
void func_8084B4A8(Player* this, PlayState* play);
void func_8084B5C0(Player* this, PlayState* play);
void func_8084BAA4(Player* this, PlayState* play);
void func_8084BBF0(Player* this, PlayState* play);
void func_8084BC64(Player* this, PlayState* play);
void func_8084BE40(Player* this, PlayState* play);
void func_8084BF28(Player* this, PlayState* play);
void func_8084BFDC(Player* this, PlayState* play);
void func_8084C16C(Player* this, PlayState* play);
void func_8084C6EC(Player* this, PlayState* play);
void func_8084C94C(Player* this, PlayState* play);
void func_8084CA24(Player* this, PlayState* play);
void func_8084CB58(Player* this, PlayState* play);
void func_8084CCEC(Player* this, PlayState* play);
void func_8084CE84(Player* this, PlayState* play);
void func_8084D18C(Player* this, PlayState* play);
void func_8084D4EC(Player* this, PlayState* play);
void func_8084D770(Player* this, PlayState* play);
void func_8084D820(Player* this, PlayState* play);
void func_8084E034(Player* this, PlayState* play);
void func_8084E25C(Player* this, PlayState* play);
void func_8084E334(Player* this, PlayState* play);
void func_8084E434(Player* this, PlayState* play);
void func_8084E4E4(Player* this, PlayState* play);
void func_8084E58C(Player* this, PlayState* play);
void func_8084E65C(Player* this, PlayState* play);
void func_8084E724(Player* this, PlayState* play);
void func_8084E980(Player* this, PlayState* play);
void func_8084ED9C(Player* this, PlayState* play);
void func_8084EE50(Player* this, PlayState* play);
void func_8084EF9C(Player* this, PlayState* play);
void func_8084F1B8(Player* this, PlayState* play);
void func_8084F3DC(Player* this, PlayState* play);
void func_8084F4E8(Player* this, PlayState* play);
void func_8084FC0C(Player* this, PlayState* play);
void func_8084FE7C(Player* this, PlayState* play);
void func_808505D0(Player* this, PlayState* play);
void func_808508C8(Player* this, PlayState* play);
void func_80850B18(Player* this, PlayState* play);
void func_80850D68(Player* this, PlayState* play);
void func_808513EC(Player* this, PlayState* play);
void func_80851588(Player* this, PlayState* play);
void func_808516B4(Player* this, PlayState* play);
void func_808519FC(Player* this, PlayState* play);
void func_80851B58(Player* this, PlayState* play);
void func_80851BD4(Player* this, PlayState* play);
void func_8085269C(Player* this, PlayState* play);
void func_80852B28(Player* this, PlayState* play);
void func_80852C04(Player* this, PlayState* play);
void func_80852FD4(Player* this, PlayState* play);
void func_80853194(Player* this, PlayState* play);
void func_808534C0(Player* this, PlayState* play);
void func_80853754(Player* this, PlayState* play);
void func_80853850(Player* this, PlayState* play);
void func_80853A5C(Player* this, PlayState* play);
void func_80853CC0(Player* this, PlayState* play);
void func_80853D68(Player* this, PlayState* play);
void func_80854010(Player* this, PlayState* play);
void func_808540A0(Player* this, PlayState* play);
void func_80854118(Player* this, PlayState* play);
void func_8085421C(Player* this, PlayState* play);
void func_8085437C(Player* this, PlayState* play);
void func_8085439C(Player* this, PlayState* play);
void func_80854430(Player* this, PlayState* play);
void func_80854614(Player* this, PlayState* play);
void func_808546D0(Player* this, PlayState* play);
void func_80854800(Player* this, PlayState* play);
void func_808548B8(Player* this, PlayState* play);
void func_80854C70(Player* this, PlayState* play);
void func_808553F4(Player* this, PlayState* play);
void func_80855818(Player* this, PlayState* play);
void func_80855A7C(Player* this, PlayState* play);
void func_80855AF4(Player* this, PlayState* play);
void func_80855B9C(Player* this, PlayState* play);
void func_80855C28(Player* this, PlayState* play);
void func_80855E08(Player* this, PlayState* play);
void func_808561B0(Player* this, PlayState* play);
void func_80856918(Player* this, PlayState* play);
void func_808573A4(Player* this, PlayState* play);
void func_80857BE8(Player* this, PlayState* play);
void func_8085B08C(Player* this, PlayState* play);

s32 func_80839518(Player* this, PlayState* play);
s32 func_808365DC(Player* this, PlayState* play);
s32 func_8083D23C(Player* this, PlayState* play);
s32 func_8083CCB4(Player* this, PlayState* play);
s32 func_808391D8(Player* this, PlayState* play);
s32 func_8083DFC4(Player* this, PlayState* play);
s32 func_8083A114(Player* this, PlayState* play);
s32 func_80848570(Player* this, PlayState* play);
s32 func_8083A580(Player* this, PlayState* play);
s32 func_8083D78C(Player* this, PlayState* play);
s32 func_80839B18(Player* this, PlayState* play);
s32 func_8083A274(Player* this, PlayState* play);
s32 func_80834DFC(Player* this, PlayState* play);
s32 func_80838A90(Player* this, PlayState* play);
s32 func_8083A0CC(Player* this, PlayState* play);

s32 func_80848780(Player* this, PlayState* play);
s32 func_808487B8(Player* this, PlayState* play);
s32 func_80848B6C(Player* this, PlayState* play);
s32 func_808490B4(Player* this, PlayState* play);
s32 func_808491B4(Player* this, PlayState* play);
s32 func_80848808(Player* this, PlayState* play);
s32 func_8084894C(Player* this, PlayState* play);
s32 func_80848A0C(Player* this, PlayState* play);
s32 func_80848AB0(Player* this, PlayState* play);
s32 func_80848E4C(Player* this, PlayState* play);
s32 func_80849054(Player* this, PlayState* play);
s32 func_8084923C(Player* this, PlayState* play);
s32 func_808492C4(Player* this, PlayState* play);
s32 func_8084933C(Player* this, PlayState* play);
s32 func_80849570(Player* this, PlayState* play);
s32 func_80849620(Player* this, PlayState* play);

/* Init Mode functions */
void Player_InitMode_0(PlayState* play, Player* this);
void Player_InitMode_1(PlayState* play, Player* this);
void Player_InitMode_2(PlayState* play, Player* this);
void Player_InitMode_3(PlayState* play, Player* this);
void Player_InitMode_4(PlayState* play, Player* this);
void Player_InitMode_5(PlayState* play, Player* this);
void Player_InitMode_6(PlayState* play, Player* this);
void Player_InitMode_7(PlayState* play, Player* this);
void func_80841744(PlayState* play, Player* this);
void func_80841744(PlayState* play, Player* this);
void func_8083ADF0(PlayState* play, Player* this);
void Player_InitMode_B(PlayState* play, Player* this);
void Player_InitMode_Telescope(PlayState* play, Player* this);
void Player_InitMode_D(PlayState* play, Player* this);
void func_8083ADF0(PlayState* play, Player* this);
void Player_InitMode_F(PlayState* play, Player* this);

void func_80859F4C(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859FCC(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859FF4(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A120(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A144(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A19C(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A1D4(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A24C(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A2AC(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A330(PlayState* play, Player* this, UNK_TYPE arg2);

void func_80859EBC(PlayState* play, Player* this, s32 arg2);

void func_80859414(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859AD0(PlayState* play, Player* this, void* arg2);
void func_80859B28(PlayState* play, Player* this, void* arg2);
void func_8085ADA0(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085AACC(PlayState* play, Player* this, UNK_TYPE arg2);
void func_808595B8(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859890(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859C60(PlayState* play, Player* this, void* arg2);
void func_8085A710(PlayState* play, Player* this, void* arg2);
void func_808595B8(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859D70(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A6C0(PlayState* play, Player* this, void* arg2);
void func_80859FF4(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A04C(PlayState* play, Player* this, void* arg);
void func_8085A144(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A1D4(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A364(PlayState* play, Player* this, void* arg2);
void func_808599DC(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A40C(PlayState* play, Player* this, void* arg2);
void func_80859708(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A2AC(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A940(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A4A4(PlayState* play, Player* this, void* arg2);
void func_8085A5DC(PlayState* play, Player* this, void* arg2);
void func_8085AA84(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A7C0(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085AA10(PlayState* play, Player* this, UNK_TYPE arg2);
void func_808599DC(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859AF8(PlayState* play, Player* this, void* arg2);
void func_80859A44(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859D44(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859EBC(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859F4C(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859F4C(PlayState* play, Player* this, UNK_TYPE arg2);

void func_8085A768(PlayState* play, Player* this, void* arg2);
void func_8085AA60(PlayState* play, Player* this, UNK_TYPE arg2);

void func_808594D0(PlayState* play, Player* this, UNK_TYPE arg2);
void func_808594D0(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085978C(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859B54(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859CA0(PlayState* play, Player* this, UNK_TYPE arg2);
void func_808594D0(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859CFC(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A66C(PlayState* play, Player* this, void* arg2);
void func_80859FCC(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A120(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A19C(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085968C(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A24C(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A330(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A8C4(PlayState* play, Player* this, UNK_TYPE arg2);
void func_8085A530(PlayState* play, Player* this, void* arg2);
void func_8085A768(PlayState* play, Player* this, void* arg2);
void func_8085AA60(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859990(PlayState* play, Player* this, UNK_TYPE arg2);
void func_80859A10(PlayState* play, Player* this, UNK_TYPE arg2);

// ActionParams
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F5A4(PlayState* play, Player* this);
void func_8082F8A0(PlayState* play, Player* this);
void func_8082F5C0(PlayState* play, Player* this);
void func_8082F5C0(PlayState* play, Player* this);
void func_8082F5C0(PlayState* play, Player* this);
void func_8082F5C0(PlayState* play, Player* this);
void func_8082F7F4(PlayState* play, Player* this);
void func_8082F62C(PlayState* play, Player* this);
void func_8082F62C(PlayState* play, Player* this);
void func_8082F62C(PlayState* play, Player* this);
void func_8082F8A0(PlayState* play, Player* this);
void func_8082F5C0(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);
void func_8082F594(PlayState* play, Player* this);

void func_80858DB4(PlayState* play, Player* this, void* anim);
void func_80858DDC(PlayState* play, Player* this, void* anim);
void func_80858E40(PlayState* play, Player* this, void* anim);
void func_80858E60(PlayState* play, Player* this, void* anim);
void func_80858E80(PlayState* play, Player* this, void* anim);
void func_80858EA0(PlayState* play, Player* this, void* anim);
void func_80858EFC(PlayState* play, Player* this, void* anim);
void func_80858F1C(PlayState* play, Player* this, void* anim);
void func_80858F3C(PlayState* play, Player* this, void* anim);
void func_80858F5C(PlayState* play, Player* this, void* anim);
void func_80858FBC(PlayState* play, Player* this, void* anim);
void func_80859028(PlayState* play, Player* this, void* anim);
void func_808591BC(PlayState* play, Player* this, void* anim);
void func_80858DFC(PlayState* play, Player* this, void* anim);
void func_80858EC0(PlayState* play, Player* this, void* anim);
void func_80858F7C(PlayState* play, Player* this, void* anim);
void func_80858F9C(PlayState* play, Player* this, void* anim);
void func_80859168(PlayState* play, Player* this, void* anim);
void func_80859210(PlayState* play, Player* this, void* arg2);

typedef struct struct_8085C2A4 {
    /* 0x0 */ LinkAnimationHeader* unk_0;
    /* 0x4 */ LinkAnimationHeader* unk_4;
    /* 0x8 */ LinkAnimationHeader* unk_8;
} struct_8085C2A4; // size = 0xC

typedef struct BlureColors {
    u8 p1StartColor[4];
    u8 p2StartColor[4];
    u8 p1EndColor[4];
    u8 p2EndColor[4];
} BlureColors;

typedef void (*PlayerCueInterpretor)(PlayState*, Player*, CsCmdActorAction*);

typedef struct struct_8085DA94 {
    /* 0x0 */ s8 type;
    /* 0x4 */ union {
        void* ptr; // Do not use, required in the absence of designated initialisors
        LinkAnimationHeader* anim;
        PlayerCueInterpretor func;
    };
} struct_8085DA94; // size = 0x8

typedef struct struct_8085E368 {
    /* 0x0 */ Vec3s base;
    /* 0x6 */ Vec3s range;
} struct_8085E368; // size = 0xC

typedef struct struct_8085D910 {
    /* 0x0 */ u8 unk_0;
    /* 0x1 */ u8 unk_1;
    /* 0x2 */ u8 unk_2;
    /* 0x3 */ u8 unk_3;
} struct_8085D910; // size = 0x4

typedef struct struct_8085D848_unk_00 {
    /* 0x00 */ s16 unk_00; /* inferred */
    /* 0x02 */ u8 unk_02;  /* inferred */
    /* 0x03 */ u8 unk_03;
    /* 0x04 */ u8 unk_04;
    /* 0x05 */ u8 unk_05;
    /* 0x06 */ u8 unk_06;
    /* 0x07 */ u8 unk_07;
} struct_8085D848_unk_00; // size = 0x08

typedef struct struct_8085D848_unk_18 {
    /* 0x00 */ Vec3f unk_00;
    /* 0x0C */ u8 unk_0C;
    /* 0x0D */ u8 unk_0D;
    /* 0x0E */ u8 unk_0E;
    /* 0x10 */ s16 unk_10;
} struct_8085D848_unk_18; // size = 0x14

typedef struct struct_8085D848 {
    /* 0x00 */ struct_8085D848_unk_00 unk_00[3];
    /* 0x18 */ struct_8085D848_unk_18 unk_18[3];
} struct_8085D848; // size = 0x54

typedef struct struct_8085D80C {
    /* 0x0 */ s16 actorId;
    /* 0x2 */ s16 params;
} struct_8085D80C; // size = 0x4

typedef struct struct_8085D798 {
    /* 0x0 */ s16 actorId;
    /* 0x2 */ s8 actorParams;
    /* 0x3 */ u8 itemId;
    /* 0x4 */ u8 actionParam;
    /* 0x5 */ u8 textId;
} struct_8085D798; // size = 0x6

typedef struct struct_8085D714 {
    /* 0x0 */ u8 unk_0;
    /* 0x4 */ LinkAnimationHeader* unk_4;
} struct_8085D714; // size = 0x8

typedef struct struct_8085D224 {
    /* 0x0 */ LinkAnimationHeader* anim;
    /* 0x4 */ f32 unk_4;
    /* 0x8 */ f32 unk_8;
} struct_8085D224; // size = 0xC

typedef struct struct_8085D13C {
    /* 0x0 */ s8 damage;
    /* 0x1 */ u8 sourceIntensity;
    /* 0x2 */ u8 decayTimer;
    /* 0x3 */ u8 decayStep;
    /* 0x4 */ u16 sfxId;
} struct_8085D13C; // size = 0x6

typedef struct struct_8085CD30 {
    /* 0x00 */ LinkAnimationHeader* unk_0;
    /* 0x04 */ LinkAnimationHeader* unk_4;
    /* 0x08 */ LinkAnimationHeader* unk_8;
    /* 0x0C */ u8 unk_C;
    /* 0x0D */ u8 unk_D;
} struct_8085CD30; // size = 0x10

typedef struct struct_8085D09C {
    /* 0x0 */ s32 dmgFlags;
    /* 0x4 */ u8 unk_4;
    /* 0x5 */ u8 unk_5;
    /* 0x6 */ u8 unk_6;
    /* 0x7 */ u8 unk_7;
} struct_8085D09C; // size = 0x8

typedef struct struct_8085CC88 {
    /* 0x0 */ LinkAnimationHeader* anim;
    /* 0x4 */ u8 frame;
} struct_8085CC88; // size = 0x8

typedef struct {
    /* 0x0 */ u8 itemId;
    /* 0x2 */ s16 actorId;
} struct_8085CD24; // size = 0x4

typedef struct {
    /* 0x0 */ Color_RGB8 unk_0;
    /* 0x3 */ Color_RGB8 unk_3;
    /* 0x6 */ Color_RGB8 unk_6;
    /* 0xA */ s16 unk_A;
    /* 0xC */ s16 unk_C;
} struct_8082F02C_arg1; // size = 0xE

#if 0
// OoT:
typedef struct GetItemEntry {
    /* 0x00 */ u8 itemId;
    /* 0x01 */ u8 field; // various bit-packed data
    /* 0x02 */ s8 gi;    // defines the draw id and chest opening animation
    /* 0x03 */ u8 textId;
    /* 0x04 */ u16 objectId;
} GetItemEntry; // size = 0x06
#endif

typedef struct GetItemEntry {
    /* 0x0 */ u8 itemId;
    /* 0x1 */ u8 field;
    /* 0x2 */ s8 unk_2;
    /* 0x3 */ u8 textId;
    /* 0x4 */ u16 objectId;
} GetItemEntry; // size = 0x6

typedef struct struct_8085D200 {
    /* 0x0 */ LinkAnimationHeader* unk_0;
    /* 0x4 */ LinkAnimationHeader* unk_4;
    /* 0x8 */ u8 unk_8;
    /* 0x9 */ u8 unk_9;
} struct_8085D200; // size = 0xC

// bss
#if 1
Vec3f D_80862AF0;
f32 D_80862AFC;
s16 D_80862B00;
s16 D_80862B02;
s32 D_80862B04;
s32 D_80862B08;
s32 D_80862B0C;
u32 D_80862B10;
s16 D_80862B14;
s16 D_80862B16;
f32 D_80862B18;
s32 D_80862B1C;
s32 D_80862B20;
s32 D_80862B24;
s16 D_80862B28;
s32 D_80862B2C;
Vec3f D_80862B30;
f32 D_80862B3C;
u32 D_80862B40;
Input* D_80862B44;
s32 D_80862B48;
s32 D_80862B4C;
EnvLightSettings D_80862B50;
s32 D_80862B6C;
#else
extern Vec3f D_80862AF0;
extern f32 D_80862AFC;
extern s16 D_80862B00;
extern s16 D_80862B02;
extern s32 D_80862B04;
extern s32 D_80862B08;
extern s32 D_80862B0C;
extern u32 D_80862B10;
extern s16 D_80862B14;
extern s16 D_80862B16;
extern f32 D_80862B18;
extern s32 D_80862B1C;
extern s32 D_80862B20;
extern s32 D_80862B24;
extern s16 D_80862B28;
extern s32 D_80862B2C;
extern Vec3f D_80862B30;
extern f32 D_80862B3C;
extern u32 D_80862B40;
extern Input* D_80862B44;
extern s32 D_80862B48;
extern s32 D_80862B4C;
