#include "global.h"

typedef struct {
    /* 0x0 */ s8 x;
    /* 0x1 */ s8 y;
} OcarinaControlStick; // size = 0x2

typedef struct {
    /* 0x0 */ Vec3f* pos;
    /* 0x4 */ f32 freqScale;
    /* 0x8 */ s8 reverbAdd;
} SfxSettings; // size = 0xC

typedef struct {
    /* 0x0 */ f32 volume;
    /* 0x4 */ f32 freqScale;
    /* 0x8 */ s8 reverb;
    /* 0x9 */ s8 panSigned;
    /* 0xA */ s8 stereoBits;
    /* 0xB */ u8 filter;
    /* 0xC */ u8 combFilterGain;
    /* 0xD */ u8 zVolume;
} SfxChannelState; // size = 0x10

typedef enum {
    /* 0x0 */ SFX_CHANNEL_PLAYER0, // SfxPlayerBank
    /* 0x1 */ SFX_CHANNEL_PLAYER1,
    /* 0x2 */ SFX_CHANNEL_PLAYER2,
    /* 0x3 */ SFX_CHANNEL_ITEM0, // SfxItemBank
    /* 0x4 */ SFX_CHANNEL_ITEM1,
    /* 0x5 */ SFX_CHANNEL_ENV0, // SfxEnvironmentBank
    /* 0x6 */ SFX_CHANNEL_ENV1,
    /* 0x7 */ SFX_CHANNEL_ENV2,
    /* 0x8 */ SFX_CHANNEL_ENEMY0, // SfxEnemyBank
    /* 0x9 */ SFX_CHANNEL_ENEMY1,
    /* 0xA */ SFX_CHANNEL_ENEMY2,
    /* 0xB */ SFX_CHANNEL_SYSTEM0, // SfxSystemBank
    /* 0xC */ SFX_CHANNEL_SYSTEM1,
    /* 0xD */ SFX_CHANNEL_OCARINA, // SfxOcarinaBank
    /* 0xE */ SFX_CHANNEL_VOICE0,  // SfxVoiceBank
    /* 0xF */ SFX_CHANNEL_VOICE1
} SfxChannelIndex; // seqPlayerIndex = 2

// Global IO ports for sequences, 8 global ports per seqPlayer
typedef enum {
    /* 0x0 */ SEQ_PLAYER_IO_PORT_0,
    /* 0x1 */ SEQ_PLAYER_IO_PORT_1,
    /* 0x2 */ SEQ_PLAYER_IO_PORT_2,
    /* 0x3 */ SEQ_PLAYER_IO_PORT_3,
    /* 0x4 */ SEQ_PLAYER_IO_PORT_4,
    /* 0x5 */ SEQ_PLAYER_IO_PORT_5,
    /* 0x6 */ SEQ_PLAYER_IO_PORT_6,
    /* 0x7 */ SEQ_PLAYER_IO_PORT_7
} SeqPlayerIOPort;

typedef struct {
    /* 0x0 */ f32 value;
    /* 0x4 */ f32 target;
    /* 0x8 */ f32 step;
    /* 0xC */ s32 remainingFrames;
} FreqLerp; // size = 0x10

s32 AudioOcarina_MemoryGameNextNote(void);

void AudioSfx_ProcessSfxSettings(void);
void Audio_UpdateSfxVolumeTransition(void);
void Audio_StepFreqLerp(FreqLerp* lerp);

s32 Audio_SetGanonsTowerBgmVolume(u8 targetVolume);

void Audio_StartMorningSceneSequence(u16 seqId);
void Audio_StartSceneSequence(u16 seqId);
void Audio_PlaySequenceWithSeqPlayerIO(s8 seqPlayerIndex, u16 seqId, u8 fadeInDuration, s8 ioPort, u8 ioData);
void Audio_SetSfxReverbIndexExceptOcarinaBank(u8 reverbIndex);
void Audio_MuteBgmPlayersForFanfare(void);
void Audio_PlayAmbience(u8 ambienceId);
void Audio_SetSfxVolumeExceptSystemAndOcarinaBanks(u8 volume);

void Audio_UpdateRiverSoundVolumes(void);
void Audio_UpdateObjSoundProperties(void);
void Audio_UpdateObjSoundFanfare(void);
void Audio_UpdateSubBgmAtPos(void);
void Audio_UpdateSequenceAtPos(void);
void Audio_UpdateSceneSequenceResumePoint(void);
void Audio_UpdateFanfare(void);
void Audio_UpdatePauseState(void);
void Audio_ResetRequestedSceneSeqId(void);

// Sfx bss
SfxSettings sSfxSettings[8];
u8 sSfxSettingsFlags;
f32 sTwoSemitonesLoweredFreq;
s8 sSfxIncreasedReverb;
f32 sSfxSyncedVolume;
f32 sSfxSyncedVolumeForMetalEffects;
f32 sSfxSyncedFreq;
FreqLerp sRiverFreqScaleLerp;
FreqLerp sWaterfallFreqScaleLerp;
f32 sSfxAdjustedFreq;
s8 sSfxCustomReverb;
u8 sRiverSoundMainBgmVol;
u8 sRiverSoundMainBgmCurrentVol;
u8 sRiverSoundMainBgmLower;
u8 sRiverSoundMainBgmRestore;
u8 sGanonsTowerVol;
f32* sSfxVolumeCur;
f32 sSfxVolumeTarget;
f32 sSfxVolumeRate;
u16 sRequestedSceneSeqId;
SfxChannelState sSfxChannelState[SEQ_NUM_CHANNELS];

// Sequence bss
u8 sRomaniSingingTimer;
u8 sRomaniSingingDisabled;
u8 sRiverSoundBgmTimer;
u8 sFanfareState;
u16 sFanfareSeqId;
u8 sMuteOnlySfxAndAmbienceSeq;
u8 sAllPlayersMutedExceptSystemAndOcarina;

typedef enum {
    /* 0 */ AUDIO_PAUSE_STATE_CLOSED,
    /* 1 */ AUDIO_PAUSE_STATE_CLOSING,
    /* 2 */ AUDIO_PAUSE_STATE_OPEN
} AudioPauseState;

u8 sAudioPauseState;
u8 sSpatialSeqIsActive[4];
u8 sSequenceFilter[8 * 4];
u8 sIsFinalHoursOrSoaring;
u8 sObjSoundFanfareSeqId;
u8 sObjSoundFanfareRequested;
Vec3f sObjSoundFanfarePos;
u8 sObjSoundPlayerIndex;
Vec3f sObjSoundPos;
s16 sObjSoundFlags;
f32 sObjSoundMinDist;
f32 sObjSoundMaxDist;
f32 sObjSoundMaxVol;
f32 sObjSoundMinVol;
Vec3f sSpatialSeqNoFilterPos;
Vec3f sSpatialSeqFilterPos;
f32 sSpatialSeqMaxDist;
u8 sSpatialSeqSeqId;
u8 sSpatialSeqFlags;
u8 D_801FD432;
u8 sSpatialSubBgmFadeTimer;
u8 D_801FD434;
u8 sSpatialSeqPlayerIndex;
u8 sSpatialSeqFadeTimer;
u16 sPrevAmbienceSeqId;

// AudioOcarina bss
OcarinaStaff sPlayingStaff;
OcarinaStaff sPlaybackStaff;
OcarinaStaff sRecordingStaff;
u32 sOcarinaUpdateTaskStart;
OcarinaControlStick sOcarinaInputStickRel;
u32 sOcarinaInputButtonCur;
u32 sOcarinaInputButtonStart;
u32 sOcarinaInputButtonPrev;
s32 sOcarinaInputButtonPress;
u8 sOcarinaDisableTimer;
u8 sOcarinaUnused;
u8 sOcarinaHasStartedSong;
u8 sFirstOcarinaSongIndex;
u8 sLastOcarinaSongIndex;
u32 sOcarinaAvailableSongFlags;
u8 sOcarinaStaffPlayingPos;
u16 sMusicStaffPos[OCARINA_SONG_MAX];
u16 sMusicStaffCurHeldLength[OCARINA_SONG_MAX];
u16 sMusicStaffExpectedLength[OCARINA_SONG_MAX];
u8 sMusicStaffExpectedPitch[OCARINA_SONG_MAX]; // Next required pitch in song playback
u8 D_801FD518[OCARINA_SONG_MAX];
u32 D_801FD530[OCARINA_SONG_MAX];
OcarinaNote sScarecrowsLongSongSecondNote;
u16 sCustomSequencePc;

// Sfx Data
// If the Sfx Bank has more than 255 values (max value of u8)
u8 gIsLargeSfxBank[] = {
    true, false, true, true, false, false, true,
};
u8 D_801D6608[] = {
    true, true, true, true, true, false, true,
};
u8 gChannelsPerBank[4][7] = {
    { 3, 2, 3, 3, 2, 1, 2 },
    { 3, 2, 2, 2, 2, 2, 2 },
    { 3, 2, 2, 2, 2, 2, 2 },
    { 4, 1, 0, 0, 2, 2, 2 },
};
u8 gUsedChannelsPerBank[4][7] = {
    { 3, 2, 3, 2, 2, 1, 1 },
    { 3, 1, 1, 1, 2, 1, 1 },
    { 3, 1, 1, 1, 2, 1, 1 },
    { 2, 1, 0, 0, 1, 1, 1 },
};
f32 sGiantsMaskFreq = 0.89167805f; // Around 2 semitones down in pitch
s8 sGiantsMaskReverbAdd = 0x40;
f32 sWaterWheelVolume = 0.65f;
f32 gSfxVolume = 1.0f;
s8 sSfxTimer = 20;
s8 sSfxTimerLerpRange2 = 30;
s8 sSfxTimerLerpRange1 = 20;
f32 sBehindScreenZ[2] = { -15.0f, -65.0f }; // Unused Remnant of OoT
u8 sAudioIncreasingTranspose = 0;           // Remnant of OoT, only unsed in unused functions
u8 gMorphaTransposeTable[16] = { 0, 0, 0, 1, 1, 2, 4, 6, 8, 8, 8, 8, 8, 8, 8, 8 }; // Unused Remnant of OoT
u8 sPrevChargeLevel = 0;
f32 sChargeLevelsSfxFreq[] = { 1.0f, 1.12246f, 1.33484f, 1.33484f };
f32 sCurChargeLevelSfxFreq = 1.0f;
u8 sGanonsTowerLevelsVol[] = {
    127, 80, 75, 73, 70, 68, 65, 60 // volumes
};
u8 sEnterGanonsTowerTimer = 0;
u16 sSfxVolumeDuration = 0;

// System Data
s8 sSoundMode = SOUNDMODE_STEREO;
s8 sAudioPauseMenuOpenOrClose = SFX_PAUSE_MENU_CLOSE;
s8 sAudioCutsceneFlag = false;
s8 sSpecReverb = 0;
s8 sAudioEnvReverb = 0;
s8 sAudioCodeReverb = 0;

// Sequence Data
u8 sPrevSeqMode = 0;
f32 sBgmEnemyDist = 0.0f;
s8 sBgmEnemyVolume = 127;
u16 sPrevMainBgmSeqId = NA_BGM_DISABLED;

#define SEQ_RESUME_POINT_NONE 0xC0
u8 sSeqResumePoint = 0;
u8 sPrevSceneSeqId = NA_BGM_GENERAL_SFX;

u32 sNumFramesStill = 0;
u32 sNumFramesMoving = 0;
u8 sAudioBaseFilter = 0;
u8 sAudioExtraFilter = 0;
u8 sAudioBaseFilter2 = 0;
u8 sAudioExtraFilter2 = 0;
s8 gUnderwaterSfxReverbAdd = 0;
Vec3f* sRiverSoundBgmPos = NULL;
f32 sRiverSoundXZDistToPlayer = 2000.0f;
u8 sObjSoundMainBgmSeqId = NA_BGM_GENERAL_SFX;

// Weights distance strongest by depth (z), weaker by left/right screen (x), and weakest by top/bottom screen (y)
#define SEQ_SCREEN_WEIGHTED_DIST(projectedPos) \
    (sqrtf(SQ((projectedPos)->z) + ((SQ((projectedPos)->x) / 4.0f) + (SQ((projectedPos)->y) / 6.0f))))

// Allows enemy bgm
#define SEQ_FLAG_ENEMY (1 << 0)

#define SEQ_FLAG_FANFARE (1 << 1)
#define SEQ_FLAG_FANFARE_KAMARO (1 << 2)

// required for Audio_RestorePrevBgm to restore a sequence after Audio_PlayBgm_StorePrevBgm
#define SEQ_FLAG_RESTORE (1 << 3)

/**
 * These two sequence flags work together to implement a “resume playing from where you left off” system for scene
 * sequences when leaving and returning to a scene. For a scene to resume playing from the point where it left off, it
 * must have `SEQ_FLAG_RESUME` attached to it. Then, if the scene changes and the new scene sequence contain
 * `SEQ_FLAG_RESUME_PREV`, the point from the previous scene sequence will be stored. Then, when returning to the
 * scene with the sequence `SEQ_FLAG_RESUME`, then the sequence will resume playing from where it left off.
 *
 * TODO: Confirm which sequences properly implement this system after sequence extraction
 */
#define SEQ_FLAG_RESUME (1 << 4)
#define SEQ_FLAG_RESUME_PREV (1 << 5)

/**
 * Will write a value of 1 to ioPort 7 when called through the scene. How it's used depends on the sequence:
 * NA_BGM_FILE_SELECT - ioPort 7 skips the harp intro when a value of 1 is written to it.
 */
#define SEQ_FLAG_SKIP_HARP_INTRO (1 << 6)

// Unused, repurposed for SubBgm
#define SEQ_FLAG_NO_AMBIENCE (1 << 7)

u8 sSeqFlags[] = {
    SEQ_FLAG_FANFARE | SEQ_FLAG_ENEMY, // NA_BGM_GENERAL_SFX
    SEQ_FLAG_ENEMY,                    // NA_BGM_AMBIENCE
    SEQ_FLAG_ENEMY,                    // NA_BGM_TERMINA_FIELD
    SEQ_FLAG_RESTORE,                  // NA_BGM_CHASE
    0,                                 // NA_BGM_MAJORAS_THEME
    0,                                 // NA_BGM_CLOCK_TOWER
    SEQ_FLAG_ENEMY,                    // NA_BGM_STONE_TOWER_TEMPLE
    SEQ_FLAG_ENEMY,                    // NA_BGM_INV_STONE_TOWER_TEMPLE
    SEQ_FLAG_FANFARE,                  // NA_BGM_FAILURE_0
    SEQ_FLAG_FANFARE,                  // NA_BGM_FAILURE_1
    0,                                 // NA_BGM_HAPPY_MASK_SALESMAN
    0,                                 // NA_BGM_SONG_OF_HEALING
    SEQ_FLAG_ENEMY,                    // NA_BGM_SWAMP_REGION
    0,                                 // NA_BGM_ALIEN_INVASION
    SEQ_FLAG_FANFARE,                  // NA_BGM_SWAMP_CRUISE
    0,                                 // NA_BGM_SHARPS_CURSE
    SEQ_FLAG_ENEMY,                    // NA_BGM_GREAT_BAY_REGION
    SEQ_FLAG_ENEMY,                    // NA_BGM_IKANA_REGION
    0,                                 // NA_BGM_DEKU_PALACE
    SEQ_FLAG_ENEMY,                    // NA_BGM_MOUNTAIN_REGION
    0,                                 // NA_BGM_PIRATES_FORTRESS
    0,                                 // NA_BGM_CLOCK_TOWN_DAY_1
    0,                                 // NA_BGM_CLOCK_TOWN_DAY_2
    0,                                 // NA_BGM_CLOCK_TOWN_DAY_3
    SEQ_FLAG_SKIP_HARP_INTRO,          // NA_BGM_FILE_SELECT
    SEQ_FLAG_RESUME,                   // NA_BGM_CLEAR_EVENT
    0,                                 // NA_BGM_ENEMY
    SEQ_FLAG_RESTORE,                  // NA_BGM_BOSS
    SEQ_FLAG_ENEMY,                    // NA_BGM_WOODFALL_TEMPLE
    0,                                 // NA_BGM_CLOCK_TOWN_MAIN_SEQUENCE
    0,                                 // NA_BGM_OPENING
    SEQ_FLAG_RESUME_PREV,              // NA_BGM_INSIDE_A_HOUSE
    SEQ_FLAG_FANFARE,                  // NA_BGM_GAME_OVER
    0,                                 // NA_BGM_CLEAR_BOSS
    SEQ_FLAG_FANFARE,                  // NA_BGM_GET_ITEM
    SEQ_FLAG_FANFARE,                  // NA_BGM_CLOCK_TOWN_DAY_2_PTR
    SEQ_FLAG_FANFARE,                  // NA_BGM_GET_HEART
    SEQ_FLAG_RESTORE,                  // NA_BGM_TIMED_MINI_GAME
    0,                                 // NA_BGM_GORON_RACE
    0,                                 // NA_BGM_MUSIC_BOX_HOUSE
    0,                                 // NA_BGM_FAIRY_FOUNTAIN
    0,                                 // NA_BGM_ZELDAS_LULLABY
    0,                                 // NA_BGM_ROSA_SISTERS
    SEQ_FLAG_FANFARE,                  // NA_BGM_OPEN_CHEST
    0,                                 // NA_BGM_MARINE_RESEARCH_LAB
    SEQ_FLAG_SKIP_HARP_INTRO,          // NA_BGM_GIANTS_THEME
    0,                                 // NA_BGM_SONG_OF_STORMS
    0,                                 // NA_BGM_ROMANI_RANCH
    0,                                 // NA_BGM_GORON_VILLAGE
    0,                                 // NA_BGM_MAYORS_OFFICE
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_EPONA
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_SUNS
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_TIME
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_STORM
    SEQ_FLAG_RESUME,                   // NA_BGM_ZORA_HALL
    SEQ_FLAG_FANFARE,                  // NA_BGM_GET_NEW_MASK
    SEQ_FLAG_RESTORE,                  // NA_BGM_MINI_BOSS
    SEQ_FLAG_FANFARE,                  // NA_BGM_GET_SMALL_ITEM
    0,                                 // NA_BGM_ASTRAL_OBSERVATORY
    SEQ_FLAG_ENEMY,                    // NA_BGM_CAVERN
    SEQ_FLAG_RESUME | SEQ_FLAG_ENEMY,  // NA_BGM_MILK_BAR
    SEQ_FLAG_FANFARE,                  // NA_BGM_ZELDA_APPEAR
    0,                                 // NA_BGM_SARIAS_SONG
    0,                                 // NA_BGM_GORON_GOAL
    0,                                 // NA_BGM_HORSE
    0,                                 // NA_BGM_HORSE_GOAL
    0,                                 // NA_BGM_INGO
    0,                                 // NA_BGM_KOTAKE_POTION_SHOP
    SEQ_FLAG_RESUME_PREV,              // NA_BGM_SHOP
    SEQ_FLAG_FANFARE,                  // NA_BGM_OWL
    SEQ_FLAG_RESUME_PREV,              // NA_BGM_SHOOTING_GALLERY
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_SOARING
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_HEALING
    SEQ_FLAG_FANFARE,                  // NA_BGM_INVERTED_SONG_OF_TIME
    SEQ_FLAG_FANFARE,                  // NA_BGM_SONG_OF_DOUBLE_TIME
    SEQ_FLAG_FANFARE,                  // NA_BGM_SONATA_OF_AWAKENING
    SEQ_FLAG_FANFARE,                  // NA_BGM_GORON_LULLABY
    SEQ_FLAG_FANFARE,                  // NA_BGM_NEW_WAVE_BOSSA_NOVA
    SEQ_FLAG_FANFARE,                  // NA_BGM_ELEGY_OF_EMPTINESS
    SEQ_FLAG_FANFARE,                  // NA_BGM_OATH_TO_ORDER
    0,                                 // NA_BGM_SWORD_TRAINING_HALL
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_LULLABY_INTRO
    SEQ_FLAG_FANFARE,                  // NA_BGM_LEARNED_NEW_SONG
    SEQ_FLAG_FANFARE,                  // NA_BGM_BREMEN_MARCH
    SEQ_FLAG_FANFARE,                  // NA_BGM_BALLAD_OF_THE_WIND_FISH
    SEQ_FLAG_RESTORE,                  // NA_BGM_SONG_OF_SOARING
    0,                                 // NA_BGM_MILK_BAR_DUPLICATE
    0,                                 // NA_BGM_FINAL_HOURS
    SEQ_FLAG_FANFARE,                  // NA_BGM_MIKAU_RIFF
    SEQ_FLAG_FANFARE,                  // NA_BGM_MIKAU_FINALE
    0,                                 // NA_BGM_FROG_SONG
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_SONATA
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_LULLABY
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_NEW_WAVE
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_ELEGY
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_OATH
    0,                                 // NA_BGM_MAJORAS_LAIR
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_LULLABY_INTRO_PTR
    SEQ_FLAG_FANFARE,                  // NA_BGM_OCARINA_GUITAR_BASS_SESSION
    SEQ_FLAG_FANFARE,                  // NA_BGM_PIANO_SESSION
    SEQ_FLAG_FANFARE,                  // NA_BGM_INDIGO_GO_SESSION
    SEQ_FLAG_ENEMY,                    // NA_BGM_SNOWHEAD_TEMPLE
    SEQ_FLAG_ENEMY,                    // NA_BGM_GREAT_BAY_TEMPLE
    SEQ_FLAG_FANFARE,                  // NA_BGM_NEW_WAVE_SAXOPHONE
    SEQ_FLAG_FANFARE,                  // NA_BGM_NEW_WAVE_VOCAL
    0,                                 // NA_BGM_MAJORAS_WRATH
    0,                                 // NA_BGM_MAJORAS_INCARNATION
    0,                                 // NA_BGM_MAJORAS_MASK
    SEQ_FLAG_FANFARE,                  // NA_BGM_BASS_PLAY
    SEQ_FLAG_FANFARE,                  // NA_BGM_DRUMS_PLAY
    SEQ_FLAG_FANFARE,                  // NA_BGM_PIANO_PLAY
    SEQ_FLAG_ENEMY,                    // NA_BGM_IKANA_CASTLE
    0,                                 // NA_BGM_GATHERING_GIANTS
    SEQ_FLAG_FANFARE_KAMARO,           // NA_BGM_KAMARO_DANCE
    0,                                 // NA_BGM_CREMIA_CARRIAGE
    SEQ_FLAG_FANFARE,                  // NA_BGM_KEATON_QUIZ
    0,                                 // NA_BGM_END_CREDITS_1
    0,                                 // NA_BGM_OPENING_LOOP
    0,                                 // NA_BGM_TITLE_THEME
    SEQ_FLAG_FANFARE,                  // NA_BGM_DUNGEON_APPEAR
    SEQ_FLAG_FANFARE,                  // NA_BGM_WOODFALL_CLEAR
    SEQ_FLAG_FANFARE,                  // NA_BGM_SNOWHEAD_CLEAR
    0,                                 //
    0,                                 // NA_BGM_INTO_THE_MOON
    0,                                 // NA_BGM_GOODBYE_GIANT
    0,                                 // NA_BGM_TATL_AND_TAEL
    0,                                 // NA_BGM_MOONS_DESTRUCTION
    0,                                 // NA_BGM_END_CREDITS_SECOND_HALF
};

s8 sSpecReverbs[] = {
    0, 0, 0, 0, 0, 0, 0, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
};

#define AMBIENCE_CHANNEL_PROPERTIES_ENTRIES_MAX 33

typedef struct {
    /* 0x0 */ u16 initChannelMask;     // bitwise flag for 16 channels, channels to initialize
    /* 0x2 */ u16 initMuteChannelMask; // bitwise flag for 16 channels, channels to mute upon initialization
    /* 0x4 */ u8 channelProperties[3 * AMBIENCE_CHANNEL_PROPERTIES_ENTRIES_MAX + 1];
} AmbienceDataIO; // size = 0x68

AmbienceDataIO sAmbienceData[20] = {
    // AMBIENCE_ID_00
    {
        // Init channel mask
        ((1 << AMBIENCE_CHANNEL_STREAM_0) | (1 << AMBIENCE_CHANNEL_CRITTER_0) | (1 << AMBIENCE_CHANNEL_CRITTER_1) |
         (1 << AMBIENCE_CHANNEL_CRITTER_2) | (1 << AMBIENCE_CHANNEL_CRITTER_3) | (1 << AMBIENCE_CHANNEL_CRITTER_4) |
         (1 << AMBIENCE_CHANNEL_CRITTER_5) | (1 << AMBIENCE_CHANNEL_CRITTER_6) | (1 << AMBIENCE_CHANNEL_RAIN) |
         (1 << AMBIENCE_CHANNEL_LIGHTNING)),
        // Init mute channel mask
        ((1 << AMBIENCE_CHANNEL_CRITTER_0) | (1 << AMBIENCE_CHANNEL_CRITTER_1) | (1 << AMBIENCE_CHANNEL_CRITTER_2) |
         (1 << AMBIENCE_CHANNEL_CRITTER_3) | (1 << AMBIENCE_CHANNEL_CRITTER_4) | (1 << AMBIENCE_CHANNEL_CRITTER_5) |
         (1 << AMBIENCE_CHANNEL_CRITTER_6) | (1 << AMBIENCE_CHANNEL_RAIN) | (1 << AMBIENCE_CHANNEL_LIGHTNING)),
        {
