#ifndef SFX_H
#define SFX_H

#include "PR/ultratypes.h"
#include "z64math.h"

/**
 * With `SFX_FLAG` on, play the entire sfx audio clip.
 * Requesting the sfx while playing will restart the sfx from the beginning.
 * i.e. sfx only needs to be requested once.
 * 
 * With `SFX_FLAG` off, play the sfx for only one frame.
 * Requesting the sfx while playing will allow the sfx to continue to the next frame.
 * i.e. sfx needs to be requested every frame.
 * 
 * By default, `SFX_FLAG` is on.
 * Use `- SFX_FLAG` to turn `SFX_FLAG` off.
 */
#define SFX_FLAG_MASK 0xC00
#define SFX_FLAG 0x800

#define NA_SE_NONE 0

// ------------ PLAYER ------------

#define NA_SE_PL_WALK_GROUND 0x800
#define NA_SE_PL_WALK_SAND 0x801
#define NA_SE_PL_WALK_CONCRETE 0x802
#define NA_SE_PL_WALK_DIRT 0x803
#define NA_SE_PL_WALK_WATER0 0x804
#define NA_SE_PL_WALK_WATER1 0x805
#define NA_SE_PL_WALK_WATER2 0x806
#define NA_SE_PL_WALK_MAGMA 0x807
#define NA_SE_PL_WALK_GRASS 0x808
#define NA_SE_PL_WALK_IRON 0x809
#define NA_SE_PL_WALK_LADDER 0x80A
#define NA_SE_PL_WALK_GLASS 0x80B
#define NA_SE_PL_WALK_METAL1 0x80C
#define NA_CODE_DIRT_DEEP 0x80D
#define NA_SE_PL_WALK_SNOW 0x80E
#define NA_SE_PL_WALK_ICE 0x80F
#define NA_SE_PL_JUMP_GROUND 0x810
#define NA_SE_PL_JUMP_SAND 0x811
#define NA_SE_PL_JUMP_CONCRETE 0x812
#define NA_SE_PL_JUMP_DIRT 0x813
#define NA_SE_PL_JUMP_WATER0 0x814
#define NA_SE_PL_JUMP_WATER1 0x815
#define NA_SE_PL_JUMP_WATER2 0x816
#define NA_SE_PL_JUMP_MAGMA 0x817

#define NA_SE_VO_GUVO00 0x6959
#define NA_SE_VO_KTVO00 0x695A
#define NA_SE_VO_KTVO01 0x695B
#define NA_SE_VO_KTVO03 0x695C
#define NA_SE_VO_ZBVO00 0x695D
#define NA_SE_VO_ZBVO01 0x695E
#define NA_SE_VO_DAVO01 0x695F
#define NA_SE_VO_SHVO04 0x6960
#define NA_SE_VO_GBVO02 0x6961
#define NA_SE_VO_GBVO03 0x6962
#define NA_SE_VO_PFVO00 0x6963
#define NA_SE_VO_PFVO01 0x6964
#define NA_SE_VO_GAVO00 0x6965
#define NA_SE_VO_GAVO01 0x6966
#define NA_SE_VO_DJVO00 0x6967
#define NA_SE_VO_DJVO01 0x6968
#define NA_SE_VO_MSVO00 0x6969
#define NA_SE_VO_MSVO01 0x696A
#define NA_SE_VO_JPVO00 0x696B
#define NA_SE_VO_HYVO00 0x696C
#define NA_SE_VO_HYVO01 0x696D
#define NA_SE_VO_BAVO00 0x696E
#define NA_SE_VO_POVO00 0x696F
#define NA_SE_VO_DAVO00 0x6970
#define NA_SE_VO_DAVO02 0x6971
#define NA_SE_VO_MKVO00 0x6972
#define NA_SE_VO_MKVO01 0x6973
#define NA_SE_VO_MKVO02 0x6974
#define NA_SE_VO_MKVO03 0x6975
#define NA_SE_VO_MKVO04 0x6976
#define NA_SE_VO_TIVO00 0x6977
#define NA_SE_VO_TIVO01 0x6978
#define NA_SE_VO_TIVO02 0x6979
#define NA_SE_VO_TIVO03 0x697A
#define NA_SE_VO_TIVO04 0x697B
#define NA_SE_VO_TIVO05 0x697C
#define NA_SE_VO_OMVO00 0x697D
#define NA_SE_VO_OMVO01 0x697E
#define NA_SE_VO_OMVO02 0x697F
#define NA_SE_VO_OMVO03 0x6980
#define NA_SE_VO_OMVO04 0x6981
#define NA_SE_VO_OMVO05 0x6982
#define NA_SE_VO_OMVO06 0x6983
#define NA_SE_VO_DEMO_FALL2 0x6984
#define NA_SE_VO_DEMO_384 0x6985
#define NA_SE_VO_DEMO_385 0x6986
#define NA_SE_VO_DEMO_386 0x6987
#define NA_SE_VO_DEMO_387 0x6988
#define NA_SE_VO_DEMO_388 0x6989
#define NA_SE_VO_DEMO_389 0x698A
#define NA_SE_VO_DEMO_390 0x698B
#define NA_SE_VO_DEMO_391 0x698C
#define NA_SE_VO_DEMO_392 0x698D
#define NA_SE_VO_DEMO_393 0x698E
#define NA_SE_VO_DEMO_394 0x698F

// ------------ Sfx Table ------------
// TODO: Extract via table after 100% decompilation

/*
#define DEFINE_SFX(enum, _1, _2, _3, _4, _5) enum,

typedef enum {
    NA_SE_PL_BASE = 0x7FF,
    #include "tables/sfx/playerbank_table.h"
    NA_SE_IT_BASE = 0x17FF,
    #include "tables/sfx/itembank_table.h"
    NA_SE_EV_BASE = 0x27FF,
    #include "tables/sfx/environmentbank_table.h"
    NA_SE_EN_BASE = 0x37FF,
    #include "tables/sfx/enemybank_table.h"
    NA_SE_SY_BASE = 0x47FF,
    #include "tables/sfx/systembank_table.h"
    NA_SE_OC_BASE = 0x57FF,
    #include "tables/sfx/ocarinabank_table.h"
    NA_SE_VO_BASE = 0x67FF,
    #include "tables/sfx/voicebank_table.h"
    NA_SE_MAX
} SfxId;

#undef DEFINE_SFX
*/

typedef enum SfxPauseMenu {
    /* 0 */ SFX_PAUSE_MENU_CLOSE,
    /* 1 */ SFX_PAUSE_MENU_OPEN
} SfxPauseMenu;

typedef enum SfxBankType {
    /* 0 */ BANK_PLAYER,
    /* 1 */ BANK_ITEM,
    /* 2 */ BANK_ENV,
    /* 3 */ BANK_ENEMY,
    /* 4 */ BANK_SYSTEM,
    /* 5 */ BANK_OCARINA,
    /* 6 */ BANK_VOICE
} SfxBankType;

typedef enum SfxState {
    /* 0 */ SFX_STATE_EMPTY,
    /* 1 */ SFX_STATE_QUEUED,
    /* 2 */ SFX_STATE_READY,
    /* 3 */ SFX_STATE_PLAYING_REFRESH,
    /* 4 */ SFX_STATE_PLAYING,
    /* 5 */ SFX_STATE_PLAYING_ONE_FRAME
} SfxState;

typedef struct {
    /* 0x00 */ f32* posX;
    /* 0x04 */ f32* posY;
    /* 0x08 */ f32* posZ;
    /* 0x0C */ f32* freqScale;
    /* 0x10 */ f32* volume;
    /* 0x14 */ s8* reverbAdd;
    /* 0x18 */ f32 dist;
    /* 0x1C */ u32 priority; // lower is more prioritized
    /* 0x20 */ u16 sfxParams;
    /* 0x22 */ u16 sfxId;
    /* 0x25 */ u8 sfxFlags;
    /* 0x24 */ u8 sfxImportance;
    /* 0x26 */ u8 state; // uses SfxState enum
    /* 0x27 */ u8 freshness;
    /* 0x28 */ u8 prev;
    /* 0x29 */ u8 next;
    /* 0x2A */ u8 channelIndex;
    /* 0x2B */ u8 randFreq;
    /* 0x2C */ u8 token;
} SfxBankEntry; // size = 0x30

#define SFX_BANK_SHIFT(sfxId)   (((sfxId) >> 12) & 0xFF)

#define SFX_BANK_MASK(sfxId)    ((sfxId) & 0xF000)

#define SFX_INDEX(sfxId)    ((sfxId) & 0x3FF)
#define SFX_BANK(sfxId)     SFX_BANK_SHIFT(SFX_BANK_MASK(sfxId))

typedef struct {
    /* 0x0 */ u32 priority; // lower is more prioritized
    /* 0x4 */ u8 entryIndex;
} ActiveSfx; // size = 0x08

// SfxParams bit-packing

// Slows the decay of volume with distance (a 3-bit number ranging from 0-7)
#define SFX_PARAM_DIST_RANGE_SHIFT 0
#define SFX_PARAM_DIST_RANGE_MASK_UPPER (4 << SFX_PARAM_DIST_RANGE_SHIFT)
#define SFX_PARAM_DIST_RANGE_MASK (7 << SFX_PARAM_DIST_RANGE_SHIFT)

// Lower SEQ_PLAYER_BGM_MAIN and SEQ_PLAYER_BGM_SUB while the sfx is playing
#define SFX_FLAG_LOWER_VOLUME_BGM (1 << 3)

// Sfx priority is not raised with distance (making it more likely to be ejected)
#define SFX_FLAG_PRIORITY_NO_DIST (1 << 4)

// If a new sfx is requested at both the same position with the same importance,
// Block that new sfx from replacing the current sfx
// Note: Only 1 sfx can be played at a specific position at once
#define SFX_FLAG_BLOCK_EQUAL_IMPORTANCE (1 << 5)

// Applies increasingly random offsets to frequency (a 2-bit number ranging from 0-3)
#define SFX_PARAM_RAND_FREQ_RAISE_SHIFT 6
#define SFX_PARAM_RAND_FREQ_RAISE_MASK (3 << SFX_PARAM_RAND_FREQ_RAISE_SHIFT)

// Sets a flag to ioPort 5
#define SFX_FLAG_8 (1 << 8)

// Use lowpass filter on surround sound
#define SFX_FLAG_SURROUND_LOWPASS_FILTER (1 << 9)

// Unused remnant of OoT
#define SFX_FLAG_BEHIND_SCREEN_Z_INDEX_SHIFT 10
#define SFX_FLAG_BEHIND_SCREEN_Z_INDEX (1 << SFX_FLAG_BEHIND_SCREEN_Z_INDEX_SHIFT)

// Randomly scale base frequency each frame through mutiplicative offset
#define SFX_PARAM_RAND_FREQ_SCALE (1 << 11)

// Sfx reverb is not raised with distance
#define SFX_FLAG_REVERB_NO_DIST (1 << 12)

// Sfx volume is not lowered with distance
#define SFX_FLAG_VOLUME_NO_DIST (1 << 13)

// SFX_FLAG_VIBRATO 
// Randomly lower base frequency each frame through additive offset
#define SFX_PARAM_RAND_FREQ_LOWER (1 << 14)

// Sfx frequency is not raised with distance
#define SFX_FLAG_FREQ_NO_DIST (1 << 15)

// Force the sfx to reset from the beginning when requested again
#define SFX_FLAG2_FORCE_RESET (1 << 0)

// Unused
#define SFX_FLAG2_UNUSED2 (1 << 2)
#define SFX_FLAG2_UNUSED4 (1 << 4)

// Do not use highpass filter on surround sound
#define SFX_FLAG2_SURROUND_NO_HIGHPASS_FILTER (1 << 5)

// Unused
#define SFX_FLAG2_UNUSED6 (1 << 6)

// Apply a low-pass filter with a lowPassCutoff of 4
#define SFX_FLAG2_APPLY_LOWPASS_FILTER (1 << 7)

typedef struct {
    /* 0x0 */ u8 importance;
    /* 0x1 */ u8 flags;
    /* 0x2 */ u16 params;
} SfxParams; // size = 0x4

// functions in sfx.c

void AudioSfx_MuteBanks(u16 muteMask);
void AudioSfx_LowerBgmVolume(u8 channelIndex);
void AudioSfx_RestoreBgmVolume(u8 channelIndex);
void AudioSfx_PlaySfx(u16 sfxId, Vec3f* pos, u8 token, f32* freqScale, f32* volume, s8* reverbAdd);
void AudioSfx_ProcessRequest(void);
void AudioSfx_StopByBank(u8 bankId);
void AudioSfx_StopByPosAndBank(u8 bankId, Vec3f* pos);
void AudioSfx_StopByPos(Vec3f* pos);
void AudioSfx_StopByPosAndId(Vec3f* pos, u16 sfxId);
void AudioSfx_StopByTokenAndId(u8 token, u16 sfxId);
void AudioSfx_StopById(u32 sfxId);
void AudioSfx_ProcessRequests(void);
void AudioSfx_ProcessActiveSfx(void);
u8 AudioSfx_IsPlaying(u32 sfxId);
void AudioSfx_Reset(void);

// functions in code_8019AF00.c

void AudioSfx_SetProperties(u8 bankId, u8 entryIndex, u8 channelIndex);
void AudioSfx_LowerSfxSettingsReverb(Vec3f* pos, s8 isReverbLowered);
void AudioSfx_SetChannelIO(Vec3f* pos, u16 sfxId, u8 ioData);

