#ifndef Z64BOMBERS_NOTEBOOK_H
#define Z64BOMBERS_NOTEBOOK_H

#include "ultra64.h"
#include "io/controller.h"
#include "z64dma.h"

#define BOMBERS_NOTEBOOK_NUM_PEOPLE 20

typedef enum BombersNotebookLoadState {
    /* 0 */ BOMBERS_NOTEBOOK_LOAD_STATE_NONE,
    /* 1 */ BOMBERS_NOTEBOOK_LOAD_STATE_STARTED,
    /* 2 */ BOMBERS_NOTEBOOK_LOAD_STATE_DONE
} BombersNotebookLoadState;

typedef enum BombersNotebookEvent {
    /*  0 */ BOMBERS_NOTEBOOK_EVENT_MET_BOMBERS,
    /*  1 */ BOMBERS_NOTEBOOK_EVENT_MET_ANJU,
    /*  2 */ BOMBERS_NOTEBOOK_EVENT_MET_KAFEI,
    /*  3 */ BOMBERS_NOTEBOOK_EVENT_MET_CURIOSITY_SHOP_MAN,
    /*  4 */ BOMBERS_NOTEBOOK_EVENT_MET_BOMB_SHOP_LADY,
    /*  5 */ BOMBERS_NOTEBOOK_EVENT_MET_ROMANI,
    /*  6 */ BOMBERS_NOTEBOOK_EVENT_MET_CREMIA,
    /*  7 */ BOMBERS_NOTEBOOK_EVENT_MET_MAYOR_DOTOUR,
    /*  8 */ BOMBERS_NOTEBOOK_EVENT_MET_MADAOME_AROMA,
    /*  9 */ BOMBERS_NOTEBOOK_EVENT_MET_TOTO,
    /* 10 */ BOMBERS_NOTEBOOK_EVENT_MET_GORMAN,
    /* 11 */ BOMBERS_NOTEBOOK_EVENT_MET_POSTMAN,
    /* 12 */ BOMBERS_NOTEBOOK_EVENT_MET_ROSA_SISTERS,
    /* 13 */ BOMBERS_NOTEBOOK_EVENT_MET_TOILET_HAND,
    /* 14 */ BOMBERS_NOTEBOOK_EVENT_MET_ANJUS_GRANDMOTHER,
    /* 15 */ BOMBERS_NOTEBOOK_EVENT_MET_KAMARO,
    /* 16 */ BOMBERS_NOTEBOOK_EVENT_MET_GROG,
    /* 17 */ BOMBERS_NOTEBOOK_EVENT_MET_GORMAN_BROTHERS,
    /* 18 */ BOMBERS_NOTEBOOK_EVENT_MET_SHIRO,
    /* 19 */ BOMBERS_NOTEBOOK_EVENT_MET_GURU_GUGU,
    /* 20 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_ROOM_KEY,
    /* 21 */ BOMBERS_NOTEBOOK_EVENT_PROMISED_MIDNIGHT_MEETING,
    /* 22 */ BOMBERS_NOTEBOOK_EVENT_PROMISED_TO_MEET_KAFEI,
    /* 23 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_LETTER_TO_KAFEI,
    /* 24 */ BOMBERS_NOTEBOOK_EVENT_DEPOSITED_LETTER_TO_KAFEI,
    /* 25 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_PENDANT_OF_MEMORIES,
    /* 26 */ BOMBERS_NOTEBOOK_EVENT_DELIVERED_PENDANT_OF_MEMORIES,
    /* 27 */ BOMBERS_NOTEBOOK_EVENT_ESCAPED_SAKONS_HIDEOUT,
    /* 28 */ BOMBERS_NOTEBOOK_EVENT_PROMISED_TO_HELP_WITH_THEM,
    /* 29 */ BOMBERS_NOTEBOOK_EVENT_DEFENDED_AGAINST_THEM,
    /* 30 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_MILK_BOTTLE,
    /* 31 */ BOMBERS_NOTEBOOK_EVENT_ESCORTED_CREMIA,
    /* 32 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_ROMANIS_MASK,
    /* 33 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_KEATON_MASK,
    /* 34 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_PRIORITY_MAIL,
    /* 35 */ BOMBERS_NOTEBOOK_EVENT_DELIVERED_PRIORITY_MAIL,
    /* 36 */ BOMBERS_NOTEBOOK_EVENT_LEARNED_SECRET_CODE,
    /* 37 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_BOMBERS_NOTEBOOK,
    /* 38 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_MAYOR_HP,
    /* 39 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_ROSA_SISTERS_HP,
    /* 40 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_TOILET_HAND_HP,
    /* 41 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_GRANDMA_SHORT_STORY_HP,
    /* 42 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_GRANDMA_LONG_STORY_HP,
    /* 43 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_POSTMAN_HP,
    /* 44 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_KAFEIS_MASK,
    /* 45 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_ALL_NIGHT_MASK,
    /* 46 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_BUNNY_HOOD,
    /* 47 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_GAROS_MASK,
    /* 48 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_CIRCUS_LEADERS_MASK,
    /* 49 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_POSTMANS_HAT,
    /* 50 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_COUPLES_MASK,
    /* 51 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_BLAST_MASK,
    /* 52 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_KAMAROS_MASK,
    /* 53 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_STONE_MASK,
    /* 54 */ BOMBERS_NOTEBOOK_EVENT_RECEIVED_BREMEN_MASK,
} BombersNotebookEvent;

typedef struct {
    /* 0x00 */ u8 loadState;
    /* 0x01 */ UNK_TYPE1 pad01[0x3F];
    /* 0x40 */ void* scheduleDmaSegment;
    /* 0x44 */ u32 scheduleDmaSegmentStart;
    /* 0x48 */ u32 scheduleDmaSegmentSize;
    /* 0x4C */ DmaRequest dmaRequest;
    /* 0x6C */ OSMesgQueue loadQueue;
    /* 0x84 */ OSMesg loadMsg[1];
    /* 0x88 */ void* scheduleSegment;
    /* 0x8C */ uintptr_t scheduleSegmentStart;
    /* 0x90 */ size_t scheduleSegmentSize;
    /* 0x94 */ s32 cursorPageRow;
    /* 0x98 */ s32 cursorEntry; // Entries are 3 apart, see BOMBERS_NOTEBOOK_ENTRY_SIZE
    /* 0x9C */ s32 cursorPage;
    /* 0xA0 */ UNK_TYPE1 padA0[0x4];
    /* 0xA4 */ s32 scrollAmount;
    /* 0xA8 */ s32 scrollOffset;
} BombersNotebook; // size = 0xAC

void BombersNotebook_Draw(BombersNotebook* this, struct GraphicsContext* gfxCtx);
void BombersNotebook_Update(struct PlayState* play, BombersNotebook* this, Input* input);
void BombersNotebook_Init(BombersNotebook* this);
void BombersNotebook_Destroy(BombersNotebook* this);

#endif
