#ifndef Z64SCENE_H
#define Z64SCENE_H

#include "ultra64.h"
#include "z64dma.h"
#include "z64cutscene.h"
#include "unk.h"

struct GameState;
struct PlayState;

#define SPAWN_ROT_FLAGS(rotation, flags) (((rotation) << 7) | (flags))

typedef struct {
    /* 0x0 */ uintptr_t vromStart;
    /* 0x4 */ uintptr_t vromEnd;
} RomFile; // size = 0x8

#define ROOM_DRAW_OPA (1 << 0)
#define ROOM_DRAW_XLU (1 << 1)

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ u32 data2;
} SCmdBase; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ void* segment;
} SCmdSpawnList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  num;
    /* 0x4 */ void* segment;
} SCmdActorList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ void* segment;
} SCmdCsCameraList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ void* segment;
} SCmdColHeader; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  num;
    /* 0x4 */ void* segment;
} SCmdRoomList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x2 */ UNK_TYPE1 pad2[2];
    /* 0x4 */ s8  west;
    /* 0x5 */ s8  vertical;
    /* 0x6 */ s8  south;
    /* 0x7 */ u8  clothIntensity;
} SCmdWindSettings; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ void* segment;
} SCmdEntranceList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  naviQuestHintFileId;
    /* 0x4 */ u32 subKeepIndex;
} SCmdSpecialFiles; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  gpFlag1;
    /* 0x4 */ u32 gpFlag2;
} SCmdRoomBehavior; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ void* segment;
} SCmdMesh; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  num;
    /* 0x4 */ void* segment;
} SCmdObjectList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  num;
    /* 0x4 */ void* segment;
} SCmdLightList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ void* segment;
} SCmdPathList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  num;
    /* 0x4 */ void* segment;
} SCmdTransiActorList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  num;
    /* 0x4 */ void* segment;
} SCmdLightSettingList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x2 */ UNK_TYPE1 pad2[2];
    /* 0x4 */ u8  hour;
    /* 0x5 */ u8  min;
    /* 0x6 */ u8  timeSpeed;
} SCmdTimeSettings; // size = 0x7

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x2 */ UNK_TYPE1 pad2[2];
    /* 0x4 */ u8  skyboxId;
    /* 0x5 */ u8  skyboxConfig;
    /* 0x6 */ u8  envLightMode;
} SCmdSkyboxSettings; // size = 0x7

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x2 */ UNK_TYPE1 pad2[2];
    /* 0x4 */ u8  unk4;
    /* 0x5 */ u8  unk5;
} SCmdSkyboxDisables; // size = 0x6

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ void* segment;
} SCmdExitList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ u32 data2;
} SCmdEndMarker; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  specId;
    /* 0x2 */ UNK_TYPE1 unk_02[4];
    /* 0x6 */ u8  ambienceId;
    /* 0x7 */ u8  seqId;
} SCmdSoundSettings; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x2 */ UNK_TYPE1 unk_02[5];
    /* 0x7 */ u8  echo;
} SCmdEchoSettings; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ void* segment;
} SCmdCutsceneData; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  scriptListCount;
    /* 0x4 */ void* segment;
} SCmdCsScriptList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ void* segment;
} SCmdAltHeaders; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ UNK_TYPE1 pad[7];
} SCmdRegionVisited; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ void* segment;
} SCmdTextureAnimations; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  num;
    /* 0x4 */ void* segment;
} SCmdCutsceneList; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  data1;
    /* 0x4 */ void* segment;
} SCmdMinimapSettings; // size = 0x8

typedef struct {
    /* 0x0 */ u8  code;
    /* 0x1 */ u8  num;
    /* 0x4 */ void* segment;
} SCmdMinimapChests; // size = 0x8

typedef enum {
    /* 0 */ ROOM_SHAPE_TYPE_NORMAL,
    /* 1 */ ROOM_SHAPE_TYPE_IMAGE,
    /* 2 */ ROOM_SHAPE_TYPE_CULLABLE,
    /* 3 */ ROOM_SHAPE_TYPE_NONE,
    /* 4 */ ROOM_SHAPE_TYPE_MAX
} RoomShapeType;

typedef struct {
    /* 0x0 */ u8 type;
} RoomShapeBase; // size = 0x1

typedef struct {
    /* 0x0 */ Gfx* opa;
    /* 0x4 */ Gfx* xlu;
} RoomShapeDListsEntry; // size = 0x8

typedef struct {
    /* 0x0 */ RoomShapeBase base;
    /* 0x1 */ u8 numEntries;
    /* 0x4 */ RoomShapeDListsEntry* entries;
    /* 0x8 */ RoomShapeDListsEntry* entriesEnd;
} RoomShapeNormal; // size = 0xC

typedef enum {
    /* 1 */ ROOM_SHAPE_IMAGE_AMOUNT_SINGLE = 1,
    /* 2 */ ROOM_SHAPE_IMAGE_AMOUNT_MULTI
} RoomShapeImageAmountType;

typedef struct {
    /* 0x0 */ RoomShapeBase base;
    /* 0x1 */ u8 amountType; // uses `RoomShapeImageAmountType`
    /* 0x4 */ RoomShapeDListsEntry* entry;
} RoomShapeImageBase; // size = 0x8

typedef struct {
    /* 0x00 */ RoomShapeImageBase base;
    /* 0x08 */ void* source;
    /* 0x0C */ u32 unk_0C;
    /* 0x10 */ void* tlut;
    /* 0x14 */ u16 width;
    /* 0x16 */ u16 height;
    /* 0x18 */ u8 fmt;
    /* 0x19 */ u8 siz;
    /* 0x1A */ u16 tlutMode;
    /* 0x1C */ u16 tlutCount;
} RoomShapeImageSingle; // size = 0x20

typedef struct {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u8 bgCamIndex; // the bg cam index this entry is for
    /* 0x04 */ void* source;
    /* 0x08 */ u32 unk_0C;
    /* 0x0C */ void* tlut;
    /* 0x10 */ u16 width;
    /* 0x12 */ u16 height;
    /* 0x14 */ u8 fmt;
    /* 0x15 */ u8 siz;
    /* 0x16 */ u16 tlutMode;
    /* 0x18 */ u16 tlutCount;
} RoomShapeImageMultiBgEntry; // size = 0x1C

typedef struct {
    /* 0x0 */ RoomShapeImageBase base;
    /* 0x8 */ u8 numBackgrounds;
    /* 0xC */ RoomShapeImageMultiBgEntry* backgrounds;
} RoomShapeImageMulti; // size = 0x10

typedef struct {
    /* 0x0 */ Vec3s boundsSphereCenter;
    /* 0x6 */ s16 boundsSphereRadius;
    /* 0x8 */ Gfx* opa;
    /* 0xC */ Gfx* xlu;
} RoomShapeCullableEntry; // size = 0x10

typedef struct {
    /* 0x0 */ RoomShapeBase base;
    /* 0x1 */ u8 numEntries;
    /* 0x4 */ RoomShapeCullableEntry* entries;
    /* 0x8 */ RoomShapeCullableEntry* entriesEnd;
} RoomShapeCullable; // size = 0xC

typedef union {
    RoomShapeBase base;
    RoomShapeNormal normal;
    union {
        RoomShapeImageBase base;
        RoomShapeImageSingle single;
        RoomShapeImageMulti multi;
    } image;
    RoomShapeCullable cullable;
} RoomShape; // "Ground Shape"

// TODO: update ZAPD
#define SCENE_CMD_MESH SCENE_CMD_ROOM_SHAPE

// TODO: Check which ones don't exist
typedef enum {
    /* 0 */ ROOM_BEHAVIOR_TYPE1_0,
    /* 1 */ ROOM_BEHAVIOR_TYPE1_1,
    /* 2 */ ROOM_BEHAVIOR_TYPE1_2,
    /* 3 */ ROOM_BEHAVIOR_TYPE1_3, // unused
    /* 4 */ ROOM_BEHAVIOR_TYPE1_4,
    /* 5 */ ROOM_BEHAVIOR_TYPE1_5
} RoomBehaviorType1;

typedef enum {
    /* 0 */ ROOM_BEHAVIOR_TYPE2_0,
    /* 1 */ ROOM_BEHAVIOR_TYPE2_1,
    /* 2 */ ROOM_BEHAVIOR_TYPE2_2,
    /* 3 */ ROOM_BEHAVIOR_TYPE2_HOT,
    /* 4 */ ROOM_BEHAVIOR_TYPE2_4,
    /* 5 */ ROOM_BEHAVIOR_TYPE2_5,
    /* 6 */ ROOM_BEHAVIOR_TYPE2_6
} RoomBehaviorType2;

typedef struct {
    /* 0x00 */ s8 num;
    /* 0x01 */ u8 unk1;
    /* 0x02 */ u8 behaviorType2;
    /* 0x03 */ u8 behaviorType1;
    /* 0x04 */ s8 echo;
    /* 0x05 */ u8 lensMode;
    /* 0x06 */ u8 enablePosLights;
    /* 0x07 */ UNK_TYPE1 pad7[0x1];
    /* 0x08 */ RoomShape* roomShape;
    /* 0x0C */ void* segment;
    /* 0x10 */ UNK_TYPE1 pad10[0x4];
} Room; // size = 0x14

typedef struct {
    /* 0x00 */ Room curRoom;
    /* 0x14 */ Room prevRoom;
    /* 0x28 */ void* roomMemPages[2]; // In a scene with transitions, roomMemory is split between two pages that toggle each transition. This is one continuous range, as the second page allocates from the end
    /* 0x30 */ u8 activeMemPage; // 0 - First page in memory, 1 - Second page
    /* 0x31 */ s8 status;
    /* 0x32 */ UNK_TYPE1 pad32[0x2];
    /* 0x34 */ void* activeRoomVram;
    /* 0x38 */ DmaRequest dmaRequest;
    /* 0x58 */ OSMesgQueue loadQueue;
    /* 0x70 */ OSMesg loadMsg[1];
    /* 0x74 */ void* unk74;
    /* 0x78 */ s8 unk78;
    /* 0x79 */ s8 unk79;
    /* 0x7A */ UNK_TYPE2 unk7A[3];
} RoomContext; // size = 0x80

typedef void(*RoomDrawHandler)(struct PlayState* play, Room* room, u32 flags);

typedef struct TransitionActorEntry {
    struct {
        s8 room;    // Room to switch to
        s8 bgCamIndex; // How the camera reacts during the transition. -2 for spiral staircase. -1 for generic door. 0+ will index scene CamData
    } /* 0x0 */ sides[2]; // 0 = front, 1 = back
    /* 0x4 */ s16 id;
    /* 0x6 */ Vec3s pos;
    /* 0xC */ s16 rotY;
    /* 0xE */ u16 params;
} TransitionActorEntry; // size = 0x10

typedef struct {
    /* 0x0 */ u8 numTransitionActors;
    /* 0x4 */ TransitionActorEntry* transitionActorList;
} DoorContext; // size = 0x8

typedef struct {
    /* 0x0 */ s16 id;
    /* 0x2 */ Vec3s pos;
    /* 0x8 */ Vec3s rot;
    /* 0xE */ s16 params;
} ActorEntry; // size = 0x10

typedef struct {
    /* 0x0 */ u8 spawn;
    /* 0x1 */ u8 room;
} EntranceEntry; // size = 0x2

typedef struct {
    /* 0x0 */ s8 sceneId;
    /* 0x1 */ s8 spawnNum;
    /* 0x2 */ u16 flags;
} EntranceTableEntry; // size = 0x4

typedef struct {
    /* 0x0 */ u32 tableCount : 8; // unused
    /* 0x4 */ EntranceTableEntry** table;
    /* 0x8 */ char* name; // unused
} SceneEntranceTableEntry; // size = 0xC

typedef struct {
    /* 0x00 */ s16 id; // Negative ids mean that the object is unloaded
    /* 0x02 */ UNK_TYPE1 pad2[0x2];
    /* 0x04 */ void* segment;
    /* 0x08 */ DmaRequest dmaReq;
    /* 0x28 */ OSMesgQueue loadQueue;
    /* 0x40 */ OSMesg loadMsg;
} ObjectStatus; // size = 0x44

typedef struct {
    /* 0x0 */ RomFile segment;
    /* 0x8 */ u16 titleTextId;
    /* 0xA */ u8 unk_A;
    /* 0xB */ u8 drawConfig;
    /* 0xC */ u8 unk_C;
    /* 0xD */ u8 unk_D;
} SceneTableEntry; // size = 0x10

typedef struct {
    /* 0x0 */ u8 r;
    /* 0x1 */ u8 g;
    /* 0x2 */ u8 b;
    /* 0x3 */ u8 a;
    /* 0x4 */ u8 lodFrac;
} F3DPrimColor; // size = 0x5

typedef struct {
    /* 0x0 */ u8 r;
    /* 0x1 */ u8 g;
    /* 0x2 */ u8 b;
    /* 0x3 */ u8 a;
} F3DEnvColor; // size = 0x4

typedef struct {
    /* 0x0 */ u16 keyFrameLength;
    /* 0x2 */ u16 keyFrameCount;
    /* 0x4 */ F3DPrimColor* primColors;
    /* 0x8 */ F3DEnvColor* envColors;
    /* 0xC */ u16* keyFrames;
} AnimatedMatColorParams; // size = 0x10

typedef struct {
    /* 0x0 */ s8 xStep;
    /* 0x1 */ s8 yStep;
    /* 0x2 */ u8 width;
    /* 0x3 */ u8 height;
} AnimatedMatTexScrollParams; // size = 0x4

typedef struct {
    /* 0x0 */ u16 keyFrameLength;
    /* 0x4 */ TexturePtr* textureList;
    /* 0x8 */ u8* textureIndexList;
} AnimatedMatTexCycleParams; // size = 0xC

typedef struct {
    /* 0x0 */ s8 segment;
    /* 0x2 */ s16 type;
    /* 0x4 */ void* params;
} AnimatedMaterial; // size = 0x8

// TODO: ZAPD
typedef RoomShapeCullableEntry PolygonDlist2;
typedef RoomShapeCullable PolygonType2;

typedef struct {
    /* 0x000 */ void* spaceStart;
    /* 0x004 */ void* spaceEnd;
    /* 0x008 */ u8 num;
    /* 0x009 */ u8 spawnedObjectCount;
    /* 0x00A */ u8 mainKeepIndex;
    /* 0x00B */ u8 subKeepIndex;
    /* 0x00C */ ObjectStatus status[OBJECT_EXCHANGE_BANK_MAX];
} ObjectContext; // size = 0x958

#define PATH_INDEX_NONE -1
#define ADDITIONAL_PATH_INDEX_NONE (u8)-1

typedef struct {
    /* 0x0 */ u8 count; // Number of points in the path
    /* 0x1 */ u8 additionalPathIndex;
    /* 0x2 */ s16 customValue; // Path specific to help distinguish different paths
    /* 0x4 */ Vec3s* points; // Segment Address to the array of points
} Path; // size = 0x8

typedef struct {
    /* 0x0 */ UNK_TYPE2 unk0;
    /* 0x2 */ UNK_TYPE2 unk2;
    /* 0x4 */ UNK_TYPE2 unk4;
    /* 0x6 */ UNK_TYPE2 unk6;
    /* 0x8 */ UNK_TYPE2 unk8;
} MinimapEntry; // size = 0xA

typedef struct {
    /* 0x0 */ MinimapEntry* entry;
    /* 0x4 */ s16 unk4;
} MinimapList; // size  = 0x8

typedef struct {
    /* 0x0 */ UNK_TYPE2 unk0;
    /* 0x2 */ UNK_TYPE2 unk2;
    /* 0x4 */ UNK_TYPE2 unk4;
    /* 0x6 */ UNK_TYPE2 unk6;
    /* 0x8 */ UNK_TYPE2 unk8;
} MinimapChest; // size = 0xA

// TODO: consider merging with bgCamInfo?
typedef struct {
    /* 0x0 */ s16 setting; // camera setting described by CameraSettingType enum
    /* 0x2 */ s16 count;
    /* 0x4 */ Vec3s* actorCsCamFuncData; // s16 data grouped in threes
} ActorCsCamInfo; // size = 0x8

typedef ActorCsCamInfo CsCameraEntry; // TODO: Remove once ZAPD updates its structs

typedef union {
    /* Command: N/A  */ SCmdBase              base;
    /* Command: 0x00 */ SCmdSpawnList         spawnList;
    /* Command: 0x01 */ SCmdActorList         actorList;
    /* Command: 0x02 */ SCmdCsCameraList      actorCsCamList;
    /* Command: 0x03 */ SCmdColHeader         colHeader;
    /* Command: 0x04 */ SCmdRoomList          roomList;
    /* Command: 0x05 */ SCmdWindSettings      windSettings;
    /* Command: 0x06 */ SCmdEntranceList      entranceList;
    /* Command: 0x07 */ SCmdSpecialFiles      specialFiles;
    /* Command: 0x08 */ SCmdRoomBehavior      roomBehavior;
    /* Command: 0x09 */ // Unused
    /* Command: 0x0A */ SCmdMesh              mesh;
    /* Command: 0x0B */ SCmdObjectList        objectList;
    /* Command: 0x0C */ SCmdLightList         lightList;
